{"source": "discourse", "title": "Which subject to choose in jan term", "url": "https://discourse.onlinedegree.iitm.ac.in/t/161071", "content": "Q: Hii all…i know this may not be the correct platform to ask this question. Actually i have 3 diploma subjects to cover - MLP, JAVA, TDS. So which 2 subject should i choose for this term?\nA: Don’t take TDS, this subject should be taken in the end else you might have some problem TDS at the end best. Gives you the best chance of doing well in it. Kind regards Yes you should do tds after mlp only it really help you alot trust me"}
{"source": "discourse", "title": "Can I take the end-term exam without submitting assignments if I missed it due to an emergency?", "url": "https://discourse.onlinedegree.iitm.ac.in/t/161072", "content": "Q: I missed the end-term exam due to an urgent emergency. The grading assignment indicates I’m NOT eligible for a final score. Does that mean this subject wont be considered at all for the final course card? Can I still take the end-term exam and be excused from submitting the assignments and projects?\nA: 24ds3000064: Can I still take the end-term exam and be excused from submitting the assignments and projects? Yes you dont have to submit your assignments but just give the End term. Just check if you have got the I grade Yes, I got I grade, I registered for the courses opting for end term only and not repeating the entire course, I still got the assignments though, I can complete those, but I am not sure the new ones will be considered for evaluation, please clarify New ones wont be considered"}
{"source": "discourse", "title": "GA1 - Development Tools - Discussion Thread [TDS Jan 2025]", "url": "https://discourse.onlinedegree.iitm.ac.in/t/161083", "content": "Q: Please post any questions related to Graded Assignment 1 - Development Tools . Important Instruction Please use markdown code formatting (fenced code blocks) when sharing code in Discourse posts. This makes the code much easier to read and differentiate from non-code text. It also makes it easier for people to copy code snippets and run it themselves. Visit this link for more details: Extended Syntax | Markdown Guide . A friendly suggestion: kindly go through Discourse Docs ! Deadline: 26 Jan 2025, midnight IST @carlton @Jivraj Please keep an eye on this thread for support.\nA: image 1296×158 7.29 KB For question 16 of GA1, It says \"Rename all files replacing each digit with the next \" Accepted answer is working only if file names are renamed as 2h3q9x.txt → 3h4q0x.txt eb209nmlca.txt → eb310nmlca.txt That means if digit is 9 then next digit should be 0. @carlton @Jivraj let me know if this is what is expected. since 9->10 or 209 → 210 is not working Hi anant, Question mentions every digit should be replaced by next one. In that case 209 would get replaced by 310 Hello Sir, When I am following that logic to rename files, assessment check is giving error “Incorrect. Try again.”"}
{"source": "discourse", "title": "GA2 - Deployment Tools - Discussion Thread [TDS Jan 2025]", "url": "https://discourse.onlinedegree.iitm.ac.in/t/161120", "content": "Q: Please post any questions related to Graded Assignment 2 - Deployment Tools . Important Instruction Please use markdown code formatting (fenced code blocks) when sharing code in Discourse posts. This makes the code much easier to read and differentiate from non-code text. It also makes it easier for people to copy code snippets and run it themselves. Visit this link for more details: Extended Syntax | Markdown Guide . A friendly suggestion: kindly go through Discourse Docs ! Deadline: Sunday, February 2, 2025 6:29 PM @carlton @Jivraj\nA: Screenshot 2025-01-12 223630 1727×195 27.1 KB i have included the email address still its giving error Screenshot 2025-01-12 223956 1674×158 12.8 KB that website is working fine . just  write the parameters after /api Hi Guddu, Can you share your GitHub repo. For GitHub pages question."}
{"source": "discourse", "title": "Contribute to My Open-Source LLM Classroom Assignment Evaluator", "url": "https://discourse.onlinedegree.iitm.ac.in/t/161214", "content": "Q: Dear all, I’m thrilled to share a project inspired by my experience in the *Tools in Data Science * course: LLM Classroom Assignment Evaluator .  This is the basic prototype. This tool leverages Google APIs and LLMs to automate grading and feedback for Google Classroom assignments, making evaluation faster and more insightful for educators. A heartfelt thanks to @s.anand , our course instructor, and TAs @Carlton and @Jivraj , whose guidance on LLM function calling and real-world applications made this project possible. I’d love to invite contributions from this amazing community to: Expand functionality and evaluation models. Fix bugs and optimize workflows. Improve documentation for broader accessibility. The GitHub repository is open for forks, pull requests, and ideas. I look forward to collaborating with you all! Update: here is a video explaining the process - https://youtu.be/xa4zhP-S3NE?feature=shared Best regards, Avinash Shrivastava\nA: Hi Avinash, Thats great work! I am glad you were able to use what you learnt from the course for something so practical. I hope you continue to develop and refine it, take feedback from the stakeholders who would be interested in this approach. I see a lot of potential in this project. Kind regards Thanks @carlton I would definitely refine it. Testing… please ignore"}
{"source": "discourse", "title": "TDS calendar link not found", "url": "https://discourse.onlinedegree.iitm.ac.in/t/162425", "content": "Q: where we can find tools in data science calendar link I cannot find it in my course tab?\nA: Hi Sahil, Please find it at the following location. Screenshot 2025-01-12 at 18.25.31 2474×1306 330 KB Kind regards"}
{"source": "discourse", "title": "Way of conduction of exam", "url": "https://discourse.onlinedegree.iitm.ac.in/t/163144", "content": "Q: My doubt is that “Will there be any coding level questions in the ROE and the weekly graded assignments?”\nA: In ROE , usually you have to find the answers of the questions by solving them using codes and tools explained in the course . For example you have a large pdf file of some patients and their disease and you are said to find number patients having some XYZ disease in that pdf . Now you can get this answer by using parsing tools and few lines of codes and after getting the results you can write that answer back in the portal . Same goes for assignments , they will be more like minor project works."}
{"source": "discourse", "title": "TDS iitm certified books", "url": "https://discourse.onlinedegree.iitm.ac.in/t/163147", "content": "Q: Can anyone forward the specified links of the books(iitm certified(logo)) or pdf’s for preparation?\nA: @Divya1 there are no IITM certified books nor PDFs for Tools in Data Science . The site https://tds.s-anand.net/ is the reference. We update the content regularly. You might want to track the changes for recent updates."}
{"source": "discourse", "title": "Tds jan 2025 calender accesss and video lecture access in portal", "url": "https://discourse.onlinedegree.iitm.ac.in/t/163158", "content": "Q: dear @carlton sir i am unable to access the course calender for tds and  also not able to get the recorded videos  of tds in my portal.kindly help  me out with this\nA: Same issue with me sir. This is how my dashboard looks like. It shows the same for week 2 as well. dashboard_tds_jahnaviHunsigida 936×561 93.3 KB @RaunakThatoi @jahnavih The course content is available at Screenshot 2025-01-13 at 22.47.14 2068×788 75.4 KB At Tools in Data Science the course calendar is also available. Screenshot 2025-01-13 at 22.51.33 2044×1082 250 KB Likewise the GAs also are available through the links in the seek portal as well as on the course domain shared above. The course introduction has very important information. Many students who faced problems in Tools for Data Science in previous terms usually never read the intro. Please be diligent to read everything carefully. Don’t gloss over these bits (they are expandable if you click on them) for eg… Screenshot 2025-01-13 at 22.59.19 778×268 22.7 KB Screenshot 2025-01-13 at 23.01.49 1684×920 104 KB Kind regards I’m confused where exactly is the TDS course? image 1920×1073 124 KB Where are the weekly videos? Where and what is the assignment? I’m confused."}
{"source": "discourse", "title": "Answers are not getting saved", "url": "https://discourse.onlinedegree.iitm.ac.in/t/163224", "content": "Q: all  the answers are getting erased next day  . when i went to answer remaining questions i had to start it all over again.\nA: GA1 - Development Tools - Discussion Thread [TDS Jan 2025] - Courses / Tools in Data Science - IITM-DSA"}
{"source": "discourse", "title": "Regarding EXTRA MATERIAL/INFORMATION/RESOURCES for the upcoming project", "url": "https://discourse.onlinedegree.iitm.ac.in/t/163241", "content": "Q: I recently explored the details of the extra credit project and found the problem statement and its clever framing both fascinating and challenging. While I’m eager to take it on, I feel my current skill set might fall short of the project’s demands. I’m committed to pushing my boundaries and would greatly appreciate your guidance on topics or resources that could help me prepare more effectively during my free time. I want to ensure I can contribute something meaningful and engaging, even if the outcome isn’t perfect. If there are any recommended readings, practice problems, or areas of focus that you believe would provide a solid foundation for approaching this project, I would be very grateful for your suggestions. Thank you for considering my request. I’m genuinely excited by the challenge and hope to make the most of this opportunity to learn and grow under your guidance. @s.anand ChatGPT can make mistakes. Check important info.\nA: @23f1002382 - The topics & resources that might help prepare for the projects at https://tds.s-anand.net/ . It’s an evolving site. We keep adding whatever’s required that’s (a) new or (b) unknown to some students. Please go through the content. Where you find gaps, please let us know. If it’s a need across multiple students, we’ll find / create the content around it. Looking forward to your project!"}
{"source": "discourse", "title": "GA3 - Large Language Models - Discussion Thread [TDS Jan 2025]", "url": "https://discourse.onlinedegree.iitm.ac.in/t/163247", "content": "Q: Please post any questions related to Graded Assignment 3 - Large Language Models . Important Instruction Please use markdown code formatting (fenced code blocks) when sharing code in Discourse posts. This makes the code much easier to read and differentiate from non-code text. It also makes it easier for people to copy code snippets and run it themselves. See below code for example ping exam.sanand.workers.dev\n\nPinging exam.sanand.workers.dev [104.21.31.149] with 32 bytes of data:\nReply from 104.21.31.149: bytes=32 time=9ms TTL=58\nReply from 104.21.31.149: bytes=32 time=8ms TTL=58\nReply from 104.21.31.149: bytes=32 time=8ms TTL=58\nReply from 104.21.31.149: bytes=32 time=9ms TTL=58\n\nPing statistics for 104.21.31.149:\n    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),\nApproximate round trip times in milli-seconds:\n    Minimum = 8ms, Maximum = 9ms, Average = 8ms Visit this link for more details: Extended Syntax | Markdown Guide . A friendly suggestion: kindly go through Discourse Docs ! Deadline: Sunday, February 2, 2025 6:29 PM @carlton @Jivraj @Saransh_Saini\nA: how to get the dummy API key? Hi Nilay, In order to make a api call to openai chat completions you are required to send authentication information(openai key) in headers. For first question of GA3 you don’t have to send actual(working) api key, any dummy api key would work(you can put your name, or tds anything works) kind regards which API should i use in 7th question"}
{"source": "discourse", "title": "Need friends", "url": "https://discourse.onlinedegree.iitm.ac.in/t/163381", "content": "Q: I am an international student with none of my peers here in this course. It would be amazing to work with other people taking this course this term and doing the assignments together. a few brains are better than one brain\nA: Yes indeed. We must connect to solve these assignments and prepare for ROE from now you can use https://acegrade.in to find community of people with same subjects as you . Just use the ‘Groups’ tab of the website and you will prolly find lot’s of friends there . Hey, I am Azhaan, the regional coordinator of Bandipur International. DM me on WhatsApp and I will connect you with the International Community of IITM BS. I am sending you a chat."}
{"source": "discourse", "title": "Score keeps resetting to 0", "url": "https://discourse.onlinedegree.iitm.ac.in/t/163765", "content": "Q: Despite saving multiple times, my score keeps resetting to zero. Should I refill the answers for all the questions before saving again? Could this issue also be caused by accessing the assignment from multiple devices?\nA: Hi Shalini, We are aware of the issue and @s.anand is working on a solution. The temporary fix is to just reenter all the answers before hitting the Save button. Thanks for the reminder, please bear with the inconvenience while its being fixed. The last submission is always saved. So please make sure that your last submission contains all the answers for all the questions. Kind regards Hello, I am also facing the same issue. In my last submission the score was 7.25. Right now it is showing 0. The problem is i had few questions remaining to solve and i dont know which ones now. All of them r showing empty in the solution box. Also i didnt write my answers someplace else, so i would have to solve all the questions again? And also if i just for example for testing submit solution of 1 question now then my score would get reduced from 7.25 to the marks of that 1 question i submitted right? Saved multiple times on the graded website as well submitted yes on the course tab but the score keeps resetting to 0 with no progress saved"}
{"source": "discourse", "title": "TA Sessions youtube links", "url": "https://discourse.onlinedegree.iitm.ac.in/t/164089", "content": "Q: Hi Team, I understand there have been 2 TA-led sessions on 16th and 17th Jan, however the recordings were not found in the playlist - https://www.youtube.com/playlist?list=PL_h5u1jMeBCl1BquBhgunA4t08XAxsA-C Please help if these were recorded or if the link is wrong. Thanks in advance!\nA: Hi Koustubh, We will upload session recordings by tomorrow. Thanks and Kind regards"}
{"source": "discourse", "title": "Issues In TDS And Replacement with another course", "url": "https://discourse.onlinedegree.iitm.ac.in/t/164147", "content": "Q: The knowledge required by students to do TDS has been revised during recent terms. ( Mentioned that as per industrial standards/ needs). Additional programming skills are required(in addition to Python) to follow the TDS Course. That means indirectly, one should complete many courses diploma in programming before doing TDS. In such a case, how to drop the course Tools In Data Science(already registered) and get it replaced with another course to save time and without incurring financial losses(as dropping a course refunds only a certain percentage of fees amount paid for the course), and do it again later in terms. It’s completely IIT Madras’s fault since it was mentioned in the academics site that no prerequisites were required for the course while the reality turned out to be far from promises. I want to either get the course structure for the TDS revised or get it replaced with some another course; incase of some course fee difference, I will pay the difference amount.\nA: i think you would have to mail this to the support @Rrishit , please do share the response you receive (or maybe already have) from Support, regarding this, here."}
{"source": "discourse", "title": "TDS Project 1 release information required", "url": "https://discourse.onlinedegree.iitm.ac.in/t/164214", "content": "Q: Project details for TDS was supposed to be released on 17 jan ; how to access its details ?\nA: Yes please, same question! @carlton @23f30007561 @adi3 It has been released. Thanks for keeping us on our toes https://tds.s-anand.net/#/project-1 Project 1 - LLM-based Automation Agent - Discussion Thread [TDS Jan 2025] Tools in Data Science Please post any questions related to Project 1 - LLM-based Automation Agent . \nDeadline: Saturday, February 15, 2025 6:29 PM (UTC) @carlton @Jivraj @Saransh_Saini Kind regards"}
{"source": "discourse", "title": "Project 1 - LLM-based Automation Agent - Discussion Thread [TDS Jan 2025]", "url": "https://discourse.onlinedegree.iitm.ac.in/t/164277", "content": "Q: Please post any questions related to Project 1 - LLM-based Automation Agent . Deadline: Sunday, February 16, 2025 6:29 PM Update on 27 Jan 2025 : A sample evaluation script for Project 1 tasks A1-A10 is available at tools-in-data-science-public/project-1 at tds-2025-01-project-1-wip · sanand0/tools-in-data-science-public · GitHub You can use this to validate your code for Project 1. Please note: This is a sample. It WILL change. Don’t rely on the dataset being the same. It WILL change. LLMs give different results each time they are called. Make sure: Your code gives correct results reliably (i.e. try a few times) Change the task in the evaluation script slightly to test variations Your AI Proxy usage resets on 1 Feb. You have a limited budget. Utilize what you can this month. For those who submit their code by Friday 31 Jan, I will run a sample evaluation and share the results.\nA: sir show us all the way to do project Hi Shouvik, We will have live sessions to guide on how to do project. Kind regards Jivraj Will those session be on youtube too?"}
{"source": "discourse", "title": "Regarding droping from TDS", "url": "https://discourse.onlinedegree.iitm.ac.in/t/164291", "content": "Q: I want to drop to drop this course for this term ,then also i need to submit the graded assignment or project (i will try my best to submit assignment).\nA: where can we find the    drop courses form ? it is not released yet, when release it will be displayed on dashboard."}
{"source": "discourse", "title": "Agenda for Today's Live Session [Flask Tutorial]", "url": "https://discourse.onlinedegree.iitm.ac.in/t/164869", "content": "Q: Hi Everyone, For today’s live session [23-01-2025] we will be giving an elaborate tutorial on using Flask framework for API creation, also we will discuss the last 3 questions of GA1. Flask is a Python Framework used for creating APIs and accessing databases. We highly encourage everyone to join this session at 8pm, as Flask is an important topic which might be useful in your projects and even ROE. Also anyone who is not enrolled in TDS, but wished to learn about Flask are also encouraged to join. Link: meet.google.com/brz-ksac-evo Timings: 8pm - 10pm Regards, Saransh Saini TDS TA\nA: Sir, Is the same meeting link valid for all the  future live sessions? It would be really helpful if you could share the updates through mail. Was this session recorded? If recorded please provide link. This session was not in calender so missed that. This session will be uploaded on YouTube soon. In the meanwhile you can access the recording here drive.google.com Live Session - TDS - 2025/01/23 19:54 GMT+05:30 - Recording Google Drive file."}
{"source": "discourse", "title": "GA2 deadline", "url": "https://discourse.onlinedegree.iitm.ac.in/t/165142", "content": "Q: I wanted to seek clarification regarding the deadline for GA2. The latest email received today mentions the deadline as 26th January, whereas an earlier email stated 2nd February, which is also reflected on the dashboard. Could you please confirm the correct deadline to avoid any confusion? image 1056×289 15.4 KB\nA: Deadline for GA 2 has been shifted to 2nd Feb. Regards, TDS TA"}
{"source": "discourse", "title": "Graded assignment 1 - Submission not shown", "url": "https://discourse.onlinedegree.iitm.ac.in/t/165396", "content": "Q: Hello, I submitted my graded assignment for TDS course. But unfortunately I did not see the question in the portal asking if I have seen all questions and attended the exam. Can someone please clarify if it shall be graded still? @carlton @Jivraj image 1340×527 17.9 KB image 1002×560 51.4 KB\nA: @Muthupalaniappan It is saying you did not attempt it because you did not answer the seek portal question. You are not graded on the seek portal question. It only exists to make sure you saw the GA and attempted it. You are only graded on your submission of GA1 on the actual assignment page where your last saved submission is used for grading. Kind regards Dear Sir, I encountered the same issue as mentioned. Could you please confirm whether GA 1 will still be evaluated under this condition, and if we will receive our actual score based on the last saved submission on the assignment page? sir can you please allow us to submit it . like open the seek portal for a few mins . because we have worked hard to finished the assignment and all our hardwork will be in vain … please"}
{"source": "discourse", "title": "Where can i find the TDS GA1 after the submission date has passed?", "url": "https://discourse.onlinedegree.iitm.ac.in/t/165416", "content": "Q: I cannot find the questions of GA1 since the submission date has passed, can you help me\nA: @cshetty Topic moved to the appropriate category in order to get faster responses. Please make it easier for others to help you, by ensuring that topics are created in the correct categories."}
{"source": "discourse", "title": "Questions closed (GA)", "url": "https://discourse.onlinedegree.iitm.ac.in/t/165433", "content": "Q: Respected Sir @carlton , I realized there are still many topics to learn in order to complete the TDS Course ( With an A or S Grade) as I have missed some questions (Couldn’t do even after studying the videos ) . Therefore wanted to learn and regardless of the scoring I still wish to complete GA1 but, I see that I can’t access the questions  anymore … Is there any way to give the answers in the portal and check. I just want to learn and test my knowledge Thank You, 22f2000559.\nA: Yeah. There must be a mechanism by which the scores get frozen but students are able to practise even after the deadline. @carlton @s.anand Please provide a solution Edit: @Yogesh1 @22f2000559 There is a way to access GA1 - you can login with any other email ID, as the site is meant for general public too. You won’t be able to submit the assignments, so you might have to self-evaluate. @22f2000559 – Good point. I’ve enabled access now. @parthpatel – nice workaround!"}
{"source": "discourse", "title": "Live sessions regarding Project 1", "url": "https://discourse.onlinedegree.iitm.ac.in/t/165593", "content": "Q: In the discussion Thread for Project 1, it was said that there will be live sessions conducted for the project, however, there hasn’t been one specifically for it. If there are live sessions that will be conducted, can we have some hands on tutorial for the project ?\nA: Hi Sakthivel, We are still covering the precursors for Project. Once we cover the required topics then we will have sessions that work through the project with the students. Kind regards"}
{"source": "discourse", "title": "Meet with Anand (TDS Faculty), Wed 5 Feb, 10:30 am - 2:30 pm", "url": "https://discourse.onlinedegree.iitm.ac.in/t/165687", "content": "Q: I will be at the IIT Madras campus next Wednesday (5 Feb) from 10:30 am to 2:30 pm IST. I’ll be at the NAC (New Academic Complex) or the NAC footsteps. If anyone would like to chat - about TDS, or anything else - you’re welcome.\nA: Screenshot 2025-01-30 at 3.07.09 pm 1300×850 81.3 KB We will be at NAC 514 Thank you for taking out time to meet today. It was great to meet you Sir, and was a great pleasant surprise to meet our wonderful TAs, @carlton and @jivraj (and, TAs for Java and Statistics I too. sorry, I am unable to tag them with names) as well. I am inspired to continue learning deeper and more… such interactions are very helpful. Thank you."}
{"source": "discourse", "title": "Course drop", "url": "https://discourse.onlinedegree.iitm.ac.in/t/165746", "content": "Q: how to drop course i cannot see any option for the same\nA: The BS programme team will send an email regarding course drop window. Kind regards"}
{"source": "discourse", "title": "Best Practices for Virtual Environments and Dependency Management in Python", "url": "https://discourse.onlinedegree.iitm.ac.in/t/165922", "content": "Q: Is it considered best practice to create a virtual environment rather than installing packages globally, especially when working on projects that require multiple libraries? I understand that in a professional setting, we often work on multiple projects simultaneously, and developing the habit of using virtual environments now can help reinforce this practice for future projects. Additionally, when managing dependencies, would it be better to install packages individually using pip or list them in a requirements.txt file? My understanding is that if a version is not specified in the requirements.txt file, it installs the latest available version, whereas specifying a version ensures a specific installation. However, I have encountered instances where a specific version failed to install, requiring me to modify the requirements.txt file and remove the version constraint. In such cases, wouldn’t installing directly via pip be more practical? That said, I also recognize that different projects may have unique dependency requirements. I’d appreciate your insights on best practices for managing dependencies efficiently.\nA: Yes, using a virtual environment is definitely considered best practice when working on Python projects. This approach helps avoid dependency conflicts between projects and ensures a consistent development environment. The main reasons why you should use virtual environments: Isolation – Each project has its own set of dependencies, preventing conflicts with other projects. Reproducibility – A virtual environment ensures that all contributors work with the same dependencies. Portability – You can share a project with others (or deploy it) without worrying about system-wide package versions interfering. Installing with pip individually (pip install package-name) • Good for quick experimentation and testing. • Not ideal for long-term project management because dependencies might update and break compatibility over time. Using requirements.txt • Best for reproducibility and collaboration since others can install the exact same dependencies using pip install -r requirements.txt. • Avoids issues where one developer uses an updated library that breaks compatibility with another developer’s setup. Specifying Versions in requirements.txt • If you don’t specify a version , pip install -r requirements.txt will install the latest available versions, which might introduce unexpected breaking changes. • If you do specify a version (package==1.2.3) , you ensure consistency but may run into problems if that version becomes unavailable or has compatibility issues. Handling Version Conflicts • If a package version fails to install, try removing the strict version constraint and reinstall. • Instead of completely omitting version numbers, consider: • Using greater than/less than constraints : package>=1.2,<2.0 (allows updates but avoids major version changes). • Running pip freeze > requirements.txt after confirming a stable environment. Best Practices Summary Always use a virtual environment (e.g., venv or conda). Use a requirements.txt file for reproducibility. Pin versions cautiously—avoid unnecessary strict versioning unless needed. Periodically review and update dependencies to prevent using outdated or insecure packages. Kind regards For some projects where there are many dependencies, like an ML project or flask app, it’s better you mantain a virtual environment since the dependencies are interconnected with their versions. Whereas for some simple projects, with less dependencies, global installation is fine. For project that is to be deployed, make sure you use the virtual environment, only then you can ensure what worked for you also works on the deployement 24f2006531: Additionally, when managing dependencies, would it be better to install packages individually using pip or list them in a requirements.txt file? Coming to your second question, The first time you install a fresh dependency, use direct and latest version. But if you are cloning or thinking of sharing the repo or using someone’s project it’s better to use requirements.txt. 24f2006531: My understanding is that if a version is not specified in the requirements.txt file, it installs the latest available version, whereas specifying a version ensures a specific installation The creation of requirements.txt ensures that the current installation version is listed. Never try to list requirements.txt. There is a command to do that, pip3 freeze > requirements.txt . This does the hard work of listing the dependencies for you Thank you sir for clarifying. carlton: • Using greater than/less than constraints : package>=1.2,<2.0 (allows updates but avoids major version changes). I wasn’t aware of greater than/less than constraint. This would definitely address the error I mentioned in my question."}
{"source": "discourse", "title": "GA4 - Data Sourcing - Discussion Thread [TDS Jan 2025]", "url": "https://discourse.onlinedegree.iitm.ac.in/t/165959", "content": "Q: Please post any questions related to Graded Assignment 4 - Data Sourcing . Please use markdown code formatting (fenced code blocks) when sharing code (rather than screenshots). It’s easier for us to copy-paste and test. Deadline: Sunday, February 9, 2025 6:29 PM @Jivraj @Saransh_Saini @carlton\nA: Screenshot 2025-02-01 132301 331×314 12.3 KB what is the error here?? sir @Jivraj I have the Same doubt. @22f3001315 @21f3002277 @24ds2000024 – please try again after reloading the page. The new error message will be clearer, like this: Error: At [0].rating: Values don't match. Expected: \"7.4\". Actual: 7.4 FYI, we expect all values as strings, not numbers. That’s because the year can sometimes be a range for a TV series (e.g. 2021 - 2024) and the rating can sometimes be missing."}
{"source": "discourse", "title": "Access to Notebooks", "url": "https://discourse.onlinedegree.iitm.ac.in/t/166100", "content": "Q: Hi @Jivraj & @carlton I was wondering if we can have access to the companion notebook for the application for order built on 31st Jan 2025. Where can we access this ?\nA: Hi Vikram, Those notebooks are for internal purpose only, we don’t use to share them. Kind regards"}
{"source": "discourse", "title": "Tds: assignment is not submitting", "url": "https://discourse.onlinedegree.iitm.ac.in/t/166189", "content": "Q: @carlton @s.anand dear sir i have taken tds in this term. after the first assignment there was no checkbox provided to any graded assignment .for this reason i just saved the assignment at the portal link .and now after the deadline its showing my assignment had not been submitted. pls do something please do it fast.\nA: GA2 - Deployment Tools - Discussion Thread [TDS Jan 2025] Tools in Data Science We have removed that button, cause it was causing confusion among the students. \nIf you have saved your answers on the TDS portal then you need not worry, you will be marked. The button was just there to ensure you saw the assignment on the TDS portal. \nRegards, \nTDS TA Read this I saved that too but right now scores of GA2 isn’t visible for me. And in score section it’s showing assignment not submitted. @Saransh_Saini Your scores are evaluated on a site that is external to the seek portal and is not integrated with the seek portal. Therefore seek does not know if you have submitted or not and by default says that it has not been submitted because it cannot see your external evaluation. There will not be a fix for this for some time. Scores for GA1, GA2, GA3, GA4, GA5, Project1, Project2, ROE will NOT be inside your seek portal. The scores will only be visible in the dashboard. Just ignore anything inside seek portal. The dashboard is where all your subject score cards exists. As stated in multiple places on discourse as well as in live sessions, The final score is always your last submission. If your dashboard score does not match your final submission score on the assignment page, only then contact us regarding your marks. Kind regards"}
{"source": "discourse", "title": "LLM what rocket science going on here", "url": "https://discourse.onlinedegree.iitm.ac.in/t/166303", "content": "Q: The lectures primarily focus on surface-level explanations without ensuring a strong foundational understanding of the topics. Key concepts, such as Large Language Models (LLMs) and related technologies, are not explained in a structured manner, making it difficult for students to follow.\nA: @carlton sir i watch live session recording , but still not getting some useful from it , I am talking about week 3 content in llm , these words are never heard by us so please try to tech from basic things please . At least tell us , what is llm and what is use of , everything is going to above of our head . Hi Hari, The goal of the course was never to go deep into specific technologies, with perhaps the exception of LLMs as major tooling capability for data science. Due to the volume of the content in the first 3 weeks it was decided to at least get students sufficient information to be able to do the Graded Assignments. One of the criticisms we received last term was that the sessions were too slow because we were covering from the very basics. So it was a conscious decision to speed up and shorten the explanations. Of course this is always difficult to get right because we respond to students in sessions. This is why attending the sessions is more valuable than watching the sessions. We cannot effectively gauge what level to pitch at if the audience is silent or not involved. We can only guess the level of the vast silent mass of students. The quality of sessions only improve when the sessions are interactive and well attended. Have you watched this session in particular? If thats insufficient for you last term we did a 2hr 48 min session on just introducing it followed by another 2 hour detailed explanation of the more advanced use cases But of course does everyone want to watch 5.5 hours of sessions to understand it? That depends on the student. Ultimately the best you can get out of sessions is by actually attending them because only then can we address gaps in understanding. Kind regards"}
{"source": "discourse", "title": "GA5 - Data Preparation - Discussion Thread [TDS Jan 2025]", "url": "https://discourse.onlinedegree.iitm.ac.in/t/166576", "content": "Q: Please post any questions related to Graded Assignment 5 - Data Preparation . Please use markdown code formatting (fenced code blocks) when sharing code (rather than screenshots). It’s easier for us to copy-paste and test. Deadline: 2025-02-15T18:30:00Z @Jivraj @Saransh_Saini @carlton\nA: image 1448×623 16.3 KB i can’t load my questions @23f1002630 - thanks for raising this. It’s fixed and won’t re-occur for anyone. What happened? I picked random duration from the video of 10-40 seconds, but forgot to ensure that the end time should not exceed the video length. That’s what I fixed. image 1158×466 11.8 KB It was solved but again I’m facing the same issue"}
{"source": "discourse", "title": "For project 1", "url": "https://discourse.onlinedegree.iitm.ac.in/t/166593", "content": "Q: Sir, I have facing lots of difficulties in assignments and it was taking alot of time to solve a single assignment, so please extend the deadline for project 1 as it contains more weightage and it required more time to solve it. Please kindly consider my request, as I am from non-technical background it is taking most of the time of a week because of which other Courses are suffering. @carlton , @Jivraj , @Saransh_Saini\nA: yes sir , most of the time goes in solving assignment as it takes a lot of time. o please extend the date of project1. Sir , kindly extend the deadline for project 1 . @carlton , @Jivraj , @Saransh_Saini"}
{"source": "discourse", "title": "Doubt in GA4 Q7", "url": "https://discourse.onlinedegree.iitm.ac.in/t/166634", "content": "Q: Sir, I am not able to understand how to solve Q7 in GA4. kindly guide me how to solve this question or provide some tutorial video to complete it. As the deadline is of today please provide the tutorial video for this question soon. @Saransh_Saini , @Jivraj , @carlton\nA: Just create the url with query parameters city and followers. Can you please elaborate a little bit what should be the steps ? Connect to the GitHub API-  it lets you fetch user data automatically(go to github developer settings ->personal acceess tokens->tokens(classic) Search for Users with criteria mentioned in your question We organize the list from newest to oldest, making it easy to spot the freshest account."}
{"source": "discourse", "title": "I have doubt in Q10", "url": "https://discourse.onlinedegree.iitm.ac.in/t/166647", "content": "Q: I have doubt in question 10 to convert pdf to markdown I am not getting correct markdown @pds_staff\nA: Try using the pymupdf4llm Library pip install pymupdf4llm import pymupdf4llm md_text = pymupdf4llm.to_markdown(“input.pdf”) import pathlib pathlib.Path(“output.md”).write_bytes(md_text.encode()) import pymupdf4llm llama_reader = pymupdf4llm.LlamaMarkdownReader() llama_docs = llama_reader.load_data(“input.pdf”)"}
{"source": "discourse", "title": "Graded Assignments Dashboard Scores Incorrect/Missing", "url": "https://discourse.onlinedegree.iitm.ac.in/t/166816", "content": "Q: hello sir this is Harish. i completed and saved the week 2 and week 4 assignment. (didn’t do week 3) but the graded assignment shows it is incomplete and the score is 0 for both the weeks . i am attaching the iages. kindly check and reply soon sir. image 1035×466 71 KB image 1035×453 27.2 KB this is for week 4 image 1678×847 141 KB image 1035×481 38.9 KB image 463×457 26.9 KB kindly check on this sir.\nA: Could you send me your email id. thanks. Hi, the same issue persists for me for GA 2 and 4. I also did not attemp GA 3. Please look into this. My email id: 24ds3000061@ds.study.iitm.ac.in My Graded assignment results are also not appearing in the dashboard. My email id is 22f2001532@ds.study.iitm.ac.in"}
{"source": "discourse", "title": "--Request for postponing the Project -1 deadline-- Official Response: Extended :)", "url": "https://discourse.onlinedegree.iitm.ac.in/t/166866", "content": "Q: Hello @carlton and @Jivraj and @s.anand sir It is becoming quite evident that a lot of us will struggle to get something decent out for the project-1 by saturday and we are struggling here. I request to reconsider the deadline and extend the due date so that it gives slightly more odds of submitting the project. Thanks Vikram\nA: @carlton @s.anand Yes Sir please extend the project deadline. yes, it is quite difficult and also the people who have done this course in previous terms are able to help just because of the difficulty. please extend the deadline or give out some resources. Yes @s.anand , @carlton , The project is complex, and an extension would really help reduce our stress and let us submit better work. Additionally, some extra help sessions would be really helpful to clarify our doubts."}
{"source": "discourse", "title": "Regarding Github Mail For Project", "url": "https://discourse.onlinedegree.iitm.ac.in/t/166891", "content": "Q: Is it important to use an IITM mail ID in GitHub for the project? @carlton\nA: Currently we do not have any explicit policy regarding requiring IITM email as the github profile name or the github repo owner. We DO however require you to use your IITM email when submitting the project submission form. We are clarifying with operations at the moment if this arrangement satisfies their requirements. If it changes we will make a general announcement via email, portal and discourse. (we do not expect the current requirements of github to change) Kind regards"}
{"source": "discourse", "title": "Sudo permission needed to create data folder in root?", "url": "https://discourse.onlinedegree.iitm.ac.in/t/167072", "content": "Q: @Jivraj @carlton sir please help When I am downloading the data folder after processing datagen.py , it is trying to download in root folder and it is facing permission error . how can we overcome this ? needs sudo permission all the time… image 2100×216 100 KB\nA: Hi Vikram, This is because (if you watched the session, or examined the code, you would have realised that) datagen.py was designed to run inside your docker container. And datagen.py (or a similar named file which we will not tell you ahead of time and will be provided as the query parameter in task A1) will normally be called by evaluate.py Inside the docker container, permission for the data folder is set by the Dockerfile which then allows your application to access the root folder inside your docker image and create the /data folder. So the workflow is like this (for your internal testing only… please follow the Project page for deliverables and evaluation to submit project successfully): You create your application server that serves 2 endpoints on localhost:8000 You create a docker image that runs this application server. You run the docker image using podman as described in the project page. For mimicking the testing conditions. You need two files: evaluate.py and datagen.py to be in the same folder where you are running these two scripts. Run evalute.py using uv. If your docker image is correctly configured and your application is correctly configured, then all the tasks run by evaluate.py will correctly tell you if the application is producing the right result for each task. Hope that gives clarity. Kind regards"}
{"source": "discourse", "title": "Regarding project1 for file not detecting after sending post request", "url": "https://discourse.onlinedegree.iitm.ac.in/t/167172", "content": "Q: sir i am getting an error in this function calling which you have demonstrate yesterday , i am attaching my code also the error with it. Please take a look and provide the solution as the deadline is close please help me as soon as possible. is there anything to do with dockerfile or anything else please explain it how to do it step by step. import os\nfrom dotenv import load_dotenv\nimport json\nimport requests\nfrom fastapi import FastAPI, HTTPException\nfrom fastapi.middleware.cors import CORSMiddleware\nimport pandas as pd\nfrom fastapi.responses import StreamingResponse, JSONResponse\nfrom typing import Dict, Any, List\nimport subprocess\nimport datetime\nfrom pathlib import Path\nimport sqlite3\n\napp = FastAPI()\n\napp.add_middleware(\n    CORSMiddleware,\n    allow_origins=[\"*\"],\n    allow_credentials=True,\n    allow_methods=[\"GET\", \"POST\"],\n    allow_headers=[\"*\"],\n)\n\n#AIPROXY_TOKEN = os.getenv(\"AIPROXY_TOKEN\")\nload_dotenv()\nAIPROXY_TOKEN = os.getenv(\"AIPROXY_TOKEN\", \"enter your token here\")\n\n\ndef sort_contacts(contacts_file_path: str, output_file_path: str):\n    try:\n        contacts = pd.read_json(contacts_file_path)\n        contacts.sort_values([\"last_name\", \"first_name\"]).to_json(output_file_path, orient=\"records\")\n        return {\"message\": f\"Contacts sorted and saved to {output_file_path}\"}\n    except Exception as e:\n        return {\"error\": f\"Failed to sort contacts: {str(e)}\"}\n\n\na4_tool = {\n    \"type\": \"function\",\n    \"function\": {\n        \"name\": \"sort_contacts\",\n        \"description\": \"This function takes data from a json file and sorts the data first by last name and then by first name, then it stores it inside the speicfied location.\",\n        \"parameters\": {\n            \"type\": \"object\",\n            \"properties\": {\n                \"contacts_file_path\": {\n                    \"type\": \"string\",\n                    \"description\": \"The relative path to the input JSON file containing the contacts.\"\n                },\n                \"output_file_path\": {\n                    \"type\": \"string\",\n                    \"description\": \"The relative path to the output JSON file to store the sorted contacts.\"\n                }\n            },\n            \"required\": [\"contacts_file_path\", \"output_file_path\"],\n            \"additionalProperties\": False\n        },\n        \"strict\": True\n    },\n}\n\n\ntools = [bakecake, a1_tool, a2_tool, a3_tool, a4_tool, a5_tool, a6_tool, a7_tool, a8_tool, a9_tool, a10_tool]\n\n\n\ndef query_gpt(user_input: str, tools: list[dict] = tools) -> dict:\n    response = requests.post(\n        url=\"https://aiproxy.sanand.workers.dev/openai/v1/chat/completions\",\n        headers={\n            \"Content-Type\": \"application/json\",\n            \"Authorization\": f\"Bearer {AIPROXY_TOKEN}\"\n        },\n        json={\n            \"model\": \"gpt-4o-mini\",\n            \"messages\": [\n                {\n                    \"role\": \"user\",\n                    \"content\": user_input\n                }\n            ],\n            \"tools\": tools,\n            \"tool_choice\": \"auto\"\n        }\n    )\n    return response.json()\n\n@app.get(\"/\")\ndef home():\n    return {\"Hello\": \"World\"}\n\n@app.get(\"/read\")\ndef read_file(path: str):\n    try:\n        with open(path, \"r\") as f:\n            return f.read()\n    except Exception as e:\n        raise HTTPException(status_code=404, detail=\"File does not exist\")\n\n@app.post(\"/run\")\nasync def run(task: str):\n    query = query_gpt(task)\n    print(query)  # Print the full response to inspect it.\n    \n    if 'choices' not in query:\n        raise HTTPException(status_code=500, detail=\"Invalid response format from GPT API\")\n    \n    try:\n        tool_calls = query['choices'][0]['message'].get('tool_calls', [])\n        if tool_calls:\n            func_name = tool_calls[0]['function']['name']\n            args = json.loads(tool_calls[0]['function']['arguments'])\n            \n            # Map function names to their respective functions\n            function_map = {\n                \"cakebake\": cakebake,\n                \"install_uv_and_run_datagen\": install_uv_and_run_datagen,\n                \"format_markdown_file\": format_markdown_file,\n                \"count_wednesdays\": count_wednesdays,\n                \"sort_contacts\": sort_contacts,\n                \"extract_recent_logs\": extract_recent_logs,\n                \"create_markdown_index\": create_markdown_index,\n                \"extract_sender_email\": extract_sender_email,\n                \"extract_credit_card_number\": extract_credit_card_number,\n                \"find_similar_comments\": find_similar_comments,\n                \"calculate_gold_ticket_sales\": calculate_gold_ticket_sales,\n            }\n            \n            if func_name in function_map:\n                output = function_map[func_name](**args)\n            else:\n                raise HTTPException(status_code=500, detail=\"Unknown function called\")\n        else:\n            raise HTTPException(status_code=500, detail=\"No function call found in response\")\n    except KeyError as e:\n        raise HTTPException(status_code=500, detail=f\"KeyError: Missing key in response - {str(e)}\")\n    except Exception as e:\n        raise HTTPException(status_code=500, detail=f\"Error processing the request: {str(e)}\")\n    \n    return output\n\nif __name__ == \"__main__\":\n    import uvicorn\n    uvicorn.run(app, host=\"0.0.0.0\", port=8000) Screenshot 2025-02-14 171217 2075×1343 176 KB @Saransh_Saini , @Jivraj , @carlton\nA: Hi Sakshi, The error is quite clear, it cannot find the file /data/contacts.json Question: What creates the /data/contacts.json file? so how to do it sir that the thing i am not able to understand. sir kindly help me with this the time is running and i am still at the starting stage of project. @carlton"}
{"source": "discourse", "title": "Project 1 - Casual banter", "url": "https://discourse.onlinedegree.iitm.ac.in/t/167344", "content": "Q: @s.anand @carlton @Jivraj Please extend the deadline please. 88394c0c2e80a1326cfffe020684be4a 480×270 10.3 KB\nA: Done Kind regards Cant say no to a fuzzy wuzzy cat Thank you very much you do not know but your 1 reply made my heart feels good (literally) What’s the new date sir"}
{"source": "discourse", "title": "Request to Consider My Last Submission for TDS Project 1", "url": "https://discourse.onlinedegree.iitm.ac.in/t/167410", "content": "Q: Dear Sir, I have submitted TDS Project 1 twice. Please consider my last submission for evaluation, as it contains the final and most updated version. Apologies for any inconvenience caused, and I appreciate your time and consideration. Best regards, Sudip Dey\nA: We consider only last submissions for Project before the deadline. Kind regards"}
{"source": "discourse", "title": "IMPORTANT: Dockerfile submitted as dockerfile rest everything is working fine", "url": "https://discourse.onlinedegree.iitm.ac.in/t/167415", "content": "Q: @carlton @Jivraj @Saransh_Saini I got a mail saying my Dockerfile is missing. However I have a dockerfile already in my github repository. Is it an issue with the spelling of dockerfile since I have submitted it in all small case as ‘dockerfile’. It was showing the score when I checked with the evaluate.py that was provided by iitm. Shall I just change the name of the file from ‘dockerfile’ to ‘Dockerfile’ in github repository of mine or is there anything else that is needed to detect the Dockerfile?\nA: The name of the Dockerfile should be “Dockerfile” indeed, more over check other sections of your submission like Is the GitHub repo public? Does it have an MIT license? Does it have a DockerFile? Is the Docker image accessible? Oh ok made the changes in Github. I hope submitting again is not required since the links and names are same. Sir, i got this mail. I have checked that the repo is public and already has a Dockerfile. I have renamed the ‘LICENSE’ file as ‘MIT LICENSE’."}
{"source": "discourse", "title": "Project 1 Submission Marked as FAIL Despite Having Dockerfile & Image", "url": "https://discourse.onlinedegree.iitm.ac.in/t/167471", "content": "Q: Dear TDS Team, I have verified my submission, and my repository does include a Dockerfile , and the Docker image is accessible on DockerHub . Please find the attached screenshot as proof. Kindly review my submission again and let me know if any further action is needed. Looking forward to your confirmation. Best regards, Arnav Mehta (21f3002647) image 250×534 3.92 KB image 713×238 11 KB\nA: @Saransh_Saini sir what should i do? @carlton Kindly have a look into this. Good Morning Sir, Sir even I am facing a similar issue, even though sanity check for docker image on docker hub was cleared but got a mail saying ‘dockerfile’ not present in the GitHub repo while it clearly was. Sir please look into it we have given so many days to complete this project. Looking forward to your reply. Thank you Satvik Sawhney 23f2003680"}
{"source": "discourse", "title": "Inconsistent information in the Grading Document and the website", "url": "https://discourse.onlinedegree.iitm.ac.in/t/167679", "content": "Q: The deadlines mentioned in the Grading Document provided and the TDS website ( s-anand.net ) are different. Project-1’s deadline was 15 Feb, it was then postponed to the 16th of Feb. Can this be reflected here? Not affecting me particularly, however, it’s good to be consistent across channels of communication to the students… grab-IIT-Madras--Microsoft Edge_at_11.39.08_on__19-02-2025__003297 1484×1168 161 KB\nA: @23f1003186 Thanks for letting us know (it might take a little while to fix) Kind regards"}
{"source": "discourse", "title": "About TDS Course", "url": "https://discourse.onlinedegree.iitm.ac.in/t/167878", "content": "Q: I have not receive week 6 assignment.Please help\nA: Yes. Week 6 and Project 2 should be released as soon as possible. @carlton Not ready yet. We will release it soon."}
{"source": "discourse", "title": "Q3, GA5 not accepting right answer", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168011", "content": "Q: image 1337×683 31.9 KB It seems that the question in Graded Assignment 5 for TDS is producing incorrect results despite the same logic working correctly for other variations of the problem. Please check into this question once as I have cross checked with many of the students and chatgpt and all of us faced  this issue in this question. Thanks! @carlton @s.anand code to take reference from: import gzip\nimport pandas as pd\nfrom datetime import datetime\n\nlog_path = 's-anand.net-May-2024.gz'\nstart_time = datetime.strptime('01:00:00', '%H:%M:%S').time()\nend_time = datetime.strptime('15:00:00', '%H:%M:%S').time()\nlog_data = []\n\ndef parse_log(line):\n    parts = line.split(' ')\n    log_time = datetime.strptime(parts[3][1:], '%d/%b/%Y:%H:%M:%S')\n    method, url, status = parts[5][1:], parts[6], int(parts[8])\n    return log_time, method, url, status\n\nwith gzip.open(log_path, 'rt') as file:\n    for entry in file:\n        log_time, method, url, status = parse_log(entry)\n        if method == 'GET' and url.startswith('/blog/') and 200 <= status < 300:\n            if log_time.weekday() == 0 and start_time <= log_time.time() < end_time:\n                log_data.append(entry)\n\nprint(f\"Successful GET requests: {len(log_data)}\") ps: I shared code after the deadline hopefully no issues there!\nA: I’m also facing same kind of issue in Q3, GA5, while cross checked answer from different methods getting same result 1603, which is showing incorrect. Kindly check this issue. Thanks The same issue is being faced by many students, not only for this condition, but others as well. Please look into it actually i got 130 as answer. but the answer accepted by the portal was 129. i felt like, i have to change one or two numbers front and back, i tried the same before. it worked"}
{"source": "discourse", "title": "GA5 Score Not Reflecting in The Page After Deadline", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168017", "content": "Q: Screenshot 2025-02-22 at 12.41.09 AM 2940×1912 443 KB Is this something to worry about?\nA: This is nothing to worry about because as you can see in the Recent saves section, it has your score history. We have your entire submission history because we log that. Kind regards"}
{"source": "discourse", "title": "QUESTION 9 of TDS WEEK 5 GA", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168057", "content": "Q: QUESTION 9 I was supposed to transcribe the audio of the provided video for a certain time period. After several attempts my submission still generated differences from the supposed answers. I have tried all forms of re-punctuations but the error wont budge. I even compared the generated transcript with the actual audio several times. I BELIEVE MY ANSWER IS CORRECT. If not I wish to know what the correct answer is. Because compared to the video I have provided the exact and well punctuated transcription of the audio between 397.2 and 505.5 seconds. Here was my transcription - \" Determined to confront the mystery, Miranda followed the elusive figure. In the dim corridor, fleeting glimpses of determination and hidden sorrow emerged, challenging her assumptions of friends and foes alike. The pursuit led her to a narrow, winding passage beneath the chapel. In the oppressive darkness, the air grew cold and heavy, and every echo of her footsteps seemed to whisper warnings of secrets best left undisturbed. In a subterranean chamber, the shadow finally halted. The figure’s voice emerged from the gloom, “You are close to the truth, but be warned some secrets, once uncovered, can never be buried again.” The mysterious stranger introduced himself as Victor, a former confidant of Edmund. His words painted a tale of coercion and betrayal—a network of hidden alliances that had forced Edmond into an impossible choice. Victor detailed clandestine meetings, cryptic codes, and a secret society that manipulated fate from behind the scenes. Miranda listened, each revelation tightening the knots of suspicion around her mind. From within his warm coat, Victor produced a faded journal brimming with names, dates, and enigmatic symbols. Its contents mirrored Edmund’s diary, strengthening the case for a conspiracy rooted in treachery. The journal hinted at a hidden hall beneath the manor, where the secret society stored evidence of their manipulations. Miranda’s pulse quickened at the thought of unmasking those responsible for decades of deceit. Returning to the manor’s main hall, Miranda retraced her steps with renewed resolve. Every shadow in the corridor now seemed charged with meaning, each creak of wood a prelude to further revelations. In the manor’s basement, beneath a concealed panel, Miranda discovered another revelation \"\nA: i downloaded mp3, trimmed the video using ffmpeg  and used this Convert your MP3 to Text for Free Online , it worked"}
{"source": "discourse", "title": "ROE instructions request", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168142", "content": "Q: Hi TDS team, with ROE being ahead, i assume an official thread will be created soon. Here are few doubts from my side. I request the official post to cover these. Syllabus kindly hint us on the type of questions, kind of tools to practice I did my ROE the last term, the time was not enough for me. I would like to know if it is actually possible to solve all the questions within the time Any mock or resource to practice from? additional tips, if any\nA: Modules 1 - 5 Questions will be similar to GAs and the content in the modules. ROE is quite hard. Only a small number will be able to do it in the given time frame. We will have some past ROEs as practise … watch sessions Kind regards Thanks for the answer @carlton Is it safe to assume that ROE is nothing but a “GA with extremely short deadline” since we don’t have proctors ? Or is the ROE more complex structured ? P.S. I am not saying the questions will be hard or easy, just asking about structure. Sir questions will be of Numeeical type or MCQs type as in earlier batches it was MCQs??"}
{"source": "discourse", "title": "My score are still not updated", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168143", "content": "Q: my score from week 2 to week 5 are still showing not submitted. Screenshot 2025-02-22 181257 1144×704 30.8 KB\nA: @23f1000879 This is not the screen where you see your scores for Tools in Data Science. Its only shown on dashboard. Can you send a screenshot of your dashboard. Thanks Kind regards"}
{"source": "discourse", "title": "Project 2 and Week 6 assignment", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168303", "content": "Q: @carlton @s.anand Release of Project 2 has been delayed by 3 days, and release of Assignment 6 has been delayed by 10 days. Could you please clarify if the submission dates will be changed accordingly? I am assuming it will have to be changed for Assignment 7 as well. Please let me know rough submission dates if possible so that I can plan accordingly (my schedule in the upcoming days is very hectic).\nA: @Yogesh GA6 will be released sometime this week. All GAs have a minimum 9 days for submissions. We do not have an ETA for Project 2 yet. Kind regards @carlton If possible, could you inform what weeks the project 2 would be based on (like Project 1 was based on week 3 content). Thanks in advance. Project 1 was based on Module 1 through 3. Project 2 will encompass Module 4 through 6 (and possibly 7) but not to the exclusion of the prior modules. These are not set in stone and still is in the design/validation phase. We generally avoid calling it week 3 content etc. because all the content was released as modules at the beginning well before the term was started. The GAs are released as we complete validations on them. Each term the course assignments are updated to stay current with industry expectations. So they are not recycled like subjects that are static like maths, statistics and programming which have syllabi that have not changed in 10 years or more. We try to release GAs so that they match the cadence of the other subjects for the convenience of students wherever possible. But rarely do other subjects require constant revalidation for their GAs. Hence we have situations, even in past terms, where GAs and Projects get moved to allow for robust validations of the answers. In spite of this some errors do slip through due to the aggressive time schedule in a trimester system as opposed to a semester system. Hope that give you some insight into how TDS works. Thanks for bearing with us. TDS is perpetually a WIP. Kind regards"}
{"source": "discourse", "title": "Clarification regarding Mock ROE Timings", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168384", "content": "Q: Hello Sir, I understand from the email we received that there are three mock ROEs scheduled. I wanted to check if it is mandatory to attempt the mock at 7 PM or if there is flexibility in the timing. As a working professional, I may not be able to attempt the mock at 7 PM. Could you please confirm if there is any flexibility in the timings? Additionally, I would appreciate it if you could provide details on when and how the mock links will be shared. Thanks and Regards Shalini\nA: Tag the TAs and instructor. Otherwise, you may not get the answer in time… It is not mandatory to attempt mocks at 7pm. But we will solve it in real time during the session. Thats why we are releasing it 1 hour before. We will freeze the form submissions during the solving session and then reopen it later. ROE is not like other exams you have done so far in this entire diploma. Solving it leisurely will give you a false sense of your capabilities. The truth is everyone can get full marks for ROE given enough time. The problem is the lack of time. So if you want to really check ROE readiness, fix the timer alarm for 45 mins and attempt it genuinely within the 45 mins. Only then will you know where you stand. Additionally, each ROE is completely different from the next. If you manage to do good in one is ZERO guarantee that you will do good in the next. Thats why do all 4 mock ROEs. ROE is not like any other exam. Other exams have the same types of questions. Not with ROE. The real ROE will be also something that no one has seen before. But we will help you be as ready as possible for it. Kind regards hi @carlton how are we supposed to give the mock ROE? where can I find the link? should i join gmeet while solving mock ROE or is it non-proctored? kindly clarify these doubts. thanks in advance!"}
{"source": "discourse", "title": "Mock ROE 1, 2, 3, 4 [TDS Jan 2025]", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168449", "content": "Q: Dear Learner, Update 6 Here is link to roe checklist file used in Friday(28 feb) session: ROE Checklist.docx - Google Docs All the best Tds team Update 5 28/02/2025 1:05 pm Dear Learner, Please find the link to Mock ROE 4. This is the final Mock before actual ROE. drive.google.com mock_roe_4.pdf Google Drive file. We have a special session scheduled for tonight from 8pm to 10pm. We will be sharing some important information during that session which will help you for your ROE. It is available in your google calendar. The meet link for that session is: ROE Preparation - TDS Friday, February 28 · 8:00 – 10:00pm Time zone: Asia/Kolkata Video call link: https://meet.google.com/nnq-sxqh-ryw The session will be recorded and live streamed on YouTube. It will be available on the TDS YouTube Playlist later. Kind regards, TDS Team Update 4 27/02/2025 7:18pm Dear Learner, Please find the link to Mock ROE 3 below. Note the datasets links are present inside the given document (there are more than 1): drive.google.com MOCK ROE 3.pdf Google Drive file. The estimated time for this Mock ROE 3 is 45 mins. All the best, TDS Team Update 3 26/02/2025 8:11 pm Dear Learner Please access the Mock ROE 2 at this link: exam.sanand.workers.dev Technical Assessment There is no time limit for this Mock. The expected time to solve this ROE is 45 mins. Set an alarm and try it. After the session at 9pm there will be a session where we will show you the solutions step by step (not like the previous session which was a demo of ROE). To check your answers you will need to run the following script in the console. inputs = document.querySelectorAll('input')\ntextboxes = document.querySelectorAll(\"textarea\")\nbuttons = document.querySelectorAll(\"button\")\ninputs.forEach(input => input.removeAttribute('disabled'));\nbuttons.forEach(input => input.removeAttribute('disabled'));\ntextboxes.forEach(input => input.removeAttribute('disabled')); Do not submit or save your answers. All the best! Kind regards TDS Team Update 2 26/02/2025 11:00 am We will be releasing Mock 2 tonight on an exam portal at 8pm (no time limit). The link for the Mock 2 will be available in this post as well as in the Seek Portal. An email will also be sent with the link to Mock 2. We will be conducting a solving session at 9pm. This will be a regular teaching session (not like the first session on Tuesday 25/02/25 which was a real preview of what ROE looks like). Kind regards, TDS Team Update 1 25/02/2025 7:46pm We have now closed the mock submissions. Both the dataset and the form submissions will reopen after tonights live session. Announcement 25/02/2025 This same information is available in the seek portal as well. The data for Mock ROE 1 is available at this link: Jivraj-18/tds-jan-2025-mock-roe-1 The questions for Mock ROE 1 is available at this link: https://forms.gle/UWhvLQvjrJmnvMSn6 IMPORTANT: We will accept only a single submission of the Mock Question Form. Solve all the questions first, and then fill the form and make a single submission at the end. The form submission will be temporarily closed after 8pm. We have provided this for you to test yourself. The expected time to complete this Mock ROE is 45 mins. We will allow access to the Mock ROE and the question form after the live solving session tonight. All the best!\nA: Should we use data mentioned in headline of form or mail data. ? From where can I get today’s live sessions link either is fine. Both have the same data but slightly different presentations"}
{"source": "discourse", "title": "Tds roe exam date shift", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168458", "content": "Q: @carlton @jkmadathil Sir please shift the ROE date to another date because we really need time to understand all these stuffs as these are so hard for beginners like us and there is quiz 2 and we have to prepare for that also. Sir please understand our situation and pay attention to our concern.\nA: Also, it seems impossible to complete it in 45 minutes. you got the wrong Anand here.  You perhaps wanted to tag the faculty of this course s.anand (I’m purposely not tagging him; you may do so) I feel for you because you constantly get incorrectly tagged. On the plus side you are famous (or infamous depending on perspective ) Kind regards"}
{"source": "discourse", "title": "Concerns Regarding TDS Course Difficulty and Grading Fairness", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168476", "content": "Q: Dear @jkmadathil @Anand @Bharathi First and foremost, we sincerely appreciate the efforts of the TDS team in supporting us throughout this course. The live sessions and guidance have been helpful, and we recognize the intent to make this a valuable learning experience. However, despite these efforts, many of us have faced significant challenges in keeping up with the course expectations. Key Challenges Faced Lack of Prerequisites This course did not list any prerequisites , leading many students—including those from non-technical backgrounds —to enroll with the expectation that they could keep up. However, the reality is that the course content, assignments, and projects have been far more complex than anticipated, making it difficult to manage. Project Complexity & Deadline Pressure The difficulty of the projects has been overwhelming, requiring most of us to rely heavily on peer support just to meet the deadlines. Despite putting in our best efforts, many of us struggled to complete them successfully. Course Structure Changes & Misleading Past Feedback Many students joined TDS based on past Discourse posts and feedback , which suggested a different course structure. With the recent changes, it has been a tough transition—especially for working professionals and students without prior experience. Remote Open Exam (RoE) & Graded Assignments (GAs) While we have put in significant effort—spending 2-3 days on Graded Assignments (GAs) to secure good scores—we still find ourselves struggling to meet expectations for the projects and RoE , which are significantly harder than anticipated. We completely understand the need to maintain academic standards, but we also hope fairness is considered. Since many of us are putting in our best efforts but still finding it hard to meet the course demands, we kindly request a revision of the grading pattern. Increasing the weightage of Graded Assignments (GAs) would help ensure that the dedication and hard work of students are fairly reflected in their grades. This would allow students to pass with a reasonable grade while still maintaining the integrity of the course. We truly respect the effort that has gone into designing this course, and we are all here because we genuinely want to learn and grow. We only ask that the grading structure consider the diverse backgrounds of students so that everyone has a fair chance to succeed. Thank you for your time and understanding. We appreciate your consideration and hope to find a way forward that benefits both students and the course objectives.\nA: Yes sir please look into this @Anand @Bharathi Yes ma’am please pay attention to our concern. Yes sir, even it is tough for tech background students, just think about that how non-tech background students are handling the pressure for this course. Please consider this request. @carlton , @Saransh_Saini , @Jivraj , @Anand"}
{"source": "discourse", "title": "TDS Module 6", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168482", "content": "Q: I am not able to see Module 6 or Module 7 in my TDS curriculum. Please let me know whether it is released already.\nA: @24ds1000012 Both Module 6 and Module 7 have been available from the start of the course. All modules were released before the 10th of Jan on the TDS course site. https://tds.s-anand.net/#/ Module 6: https://tds.s-anand.net/#/data-analysis Module 7: https://tds.s-anand.net/#/data-visualization GA 6 will become available sometime this week. We do not currently have an ETA on GA 7 and Project 2. Please refer to pinned post at the top of TDS page for new dates. Kind regards"}
{"source": "discourse", "title": "Revised dates [TDS Jan 2025]", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168506", "content": "Q: A few updates on dates. Hope this eases pressure a little. Graded Assignment 6 moved from 14 Feb to 28 Feb 2025. Submission date moved from 9 Mar to 16 Mar 2025. Project 2 moved from 21 Feb to 3 Mar 2025. Submission date moved from 17 Mar to 31 Mar 2025. Graded Assignment 7 moved from 28 Feb to 7 Mar 2025. Submission date moved from 16 Mar to 26 Mar 2025. Project 1 results will be released by 16 Mar 2025. The TDS course page now reflects these dates.\nA: @carlton @s.anand I don’t see the link to GA6 on the course page. Its in seek portal. Please login to your Dashboard and check. A post was merged into an existing topic: Graded assignment 6"}
{"source": "discourse", "title": "Opening previous ga just for practise", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168515", "content": "Q: Good morning sir, I want to request that you open the previous GAs to solve the questions and check for the answers. I don’t wish for them to be graded, but I would like to work with the portal and validate my answers for the questions stated in the GA itself. This would be of great help and could help prepare the upcoming ROE. Thank you for considering my request. Regards. @carlton @Jeevesh\nA: Hi @22f3001011 You can access questions by just enabling input boxes, and check answers button. Kind regrads Thank you sir. Will try it out."}
{"source": "discourse", "title": "ROE timing overlaps with Java OPPE", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168537", "content": "Q: On 2nd March, I have both Java OPPE and TDS ROE. My Java OPPE timing is: 9:30 to 11:00 AM MY TDS ROE timing is: 10:30 to 11:15 AM A minimum gap of one hour is recommended. I have written to support. @carlton Please look into this.\nA: I guess roe time is 13:00 to 13:45 and it is same for all , also check calender for the same. @Nelson TDS ROE is at 1pm in the afternoon for everyone. Apologies for the confusion. I realized that the issue was due to different time zones—Java OPPE displayed IST (GMT +5:30), while TDS ROE showed AST (GMT +3). On the same day, I intended to delete my post on Discourse but couldn’t find it, as it was still in draft mode. So, I deleted it. However, I was surprised to see the post today. I regret any inconvenience caused."}
{"source": "discourse", "title": "Create a Question solving groups for ROE", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168567", "content": "Q: Whoever wants can participate and then we go into breakout rooms and each group solves a particular question and then we all share the code so we can complete the ROE faster and more effienctly? @all\nA: Are we allowed to do that? Yeah they said you can take help anyway possible even  to ask a cat also or a pet, im not sure Alright, works. I am down to collaborate."}
{"source": "discourse", "title": "Not recieved the roe link mail", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168825", "content": "Q: Hello sir, I did not recieve the mail for roe exam Pls look into it.\nA: Hi @23f2003535 Mail was sent 1hour ago, you would have received now. sir we have to join the google meet for roe also?? Or its an open book exam?"}
{"source": "discourse", "title": "Remote Online Exam [TDS Jan 2025]", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168832", "content": "Q: This is the official page for discussing anything related to the ROE itself. Please limit posts on this thread to technical questions or doubts regarding the ROE itself. The Remote Online Exam has been scheduled for Sunday, 2nd March 2025 ( 02/03/2025 ) at 1:00pm The exam link will become available at the below mentioned site, 1 hour before the start time: https://study.iitm.ac.in/ds/exam.html [EDIT] There will be a Gmeet manned by the course team from Sunday, March 2, 2025 7:20 AM → Sunday, March 2, 2025 8:20 AM to solve your technical issues (timeouts, question not visible etc). Please do not ask concept related questions in this meet. Use this only for clarifying technical issues. If your issue is resolved, PLEASE EXIT THE MEET. Lurkers will be penalized There is a bonus provided for student feedback on the ROE exam preparation and attempt. This will be available till Sunday, March 2, 2025 11:30 AM All the best, TDS Team\nA: Would we be able to start work on the questions 1 hour before the exam start time? @bhashwar_sengupta No that will not be possible. It will go live only at 1 pm. Got it. Thank you. Also, are there any standard set of instructions that we need to follow during the ROE, like in OPPEs?"}
{"source": "discourse", "title": "ROE Common Snippets Repo Feb 2025", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168901", "content": "Q: github.com GitHub - ritwiktrivedi/ROE-Master-Snippets-File Contribute to ritwiktrivedi/ROE-Master-Snippets-File development by creating an account on GitHub. This is a repo some of us have been working on. It not complete but we are getting there. PRs are appreciated. Thanks to the course team for giving us this idea of having snippets for common operations.\nA: I am too sleepy to work on it now… So seriously… PRs are not only appreciated but needed. Just add the basic parsing code or image manipulation for ga5. I will try and add in the morning but who doesn’t like Good PRs? Also mentioning @23f2005325 (Aishik) here for his wonderful PR which I have now merged. hi, thanks to you and the other contributors for the effort i have added llm week-3 codes through pull request. my code my not be perfect. but when I ran it in my laptop, it worked fine. pls do verify once before ROE image 401×374 21 KB This looks beautiful"}
{"source": "discourse", "title": "Project 1 tds score not showing i", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168916", "content": "Q: My project 1 marks are not showing in the dashboard. please check on that. i submitted my project on 16.02,2025 23f3000975@ds.study.iitm.ac.in  - my id\nA: Project results have not been released yet. They have posponed everything. Please look into this post. Revised dates [TDS Jan 2025] Tools in Data Science A few updates on dates. Hope this eases pressure a little. \n\nGraded Assignment 6 moved from 14 Feb to 28 Feb 2025. Submission date moved from 9 Mar to 16 Mar 2025.\nProject 2 moved from 21 Feb to 3 Mar 2025. Submission date moved from 17 Mar to 31 Mar 2025.\nGraded Assignment 7 moved from 28 Feb to 7 Mar 2025. Submission date moved from 16 Mar to 26 Mar 2025.\nProject 1 results will be released by 16 Mar 2025.\n\nThe TDS course page now reflects these dates. Hi @carlton , My Project 1 scores are not visible on the part, I have definitely submitted before the deadline and on the grades section - its coming as not submitted. I have mailed support team as well. Will it be possible to check the same in any manner. Regards, Ajit No one has received their Project 1 scores yet. We are hoping to very soon announce preliminary results. (maybe in 24 hours or so). Depends how many bugs we get bitten by. Kind regards"}
{"source": "discourse", "title": "Solving ROE Realtime", "url": "https://discourse.onlinedegree.iitm.ac.in/t/168943", "content": "Q: I’ll try to post whatever i solve lol XD\nA: Q 7 LLM Embeddings (1 mark) SecurePay , a leading fintech startup, has implemented an innovative feature to detect and prevent fraudulent activities in real time. As part of its security suite, the system analyzes personalized transaction messages by converting them into embeddings. These embeddings are compared against known patterns of legitimate and fraudulent messages to flag unusual activity. Imagine you are working on the SecurePay team as a junior developer tasked with integrating the text embeddings feature into the fraud detection module. When a user initiates a transaction, the system sends a personalized v… ANSWER: { “model”: “text-embedding-3-small”, “input”: [ “Dear user, please verify your transaction code 33692 sent to roe-23f1002382@ds.study.iitm.ac.in”, “Dear user, please verify your transaction code 66801 sent to roe-23f1002382@ds.study.iitm.ac.in” ] } Q^: 6 Move and rename files (1 mark) Download q-move-rename-files.zip and extract it. Use mv to move all files under folders into an empty folder. Then rename all files replacing each digit with the next. 1 becomes 2, 9 becomes 0, a1b9c.txt becomes a2b0c.txt . ANSWER: unzip /workspaces/TDS/q-move-rename-files.zip -d extracted_folder123123\n    5  mkdir empty_folder \n    6  find extracted_folder -type f -exec mv {} empty_folder/ \\; \n    7  ls\n    8  find extracted_folder123123 -type f -exec mv {} empty_folder/ \\; \n    9  cd empty_folder  \n   10  for file in *; do       new_name=$(echo \"$file\" | tr '0123456789' '1234567890')  ;     mv \"$file\" \"$new_name\"  ; done  \n   11  grep . * | LC_ALL=C sort | sha256sum Sydney,Brisbane,Perth,Jakarta,Singapore,Dubai,Doha flights"}
{"source": "discourse", "title": "Project 2 - TDS Solver - Discussion Thread", "url": "https://discourse.onlinedegree.iitm.ac.in/t/169029", "content": "Q: Please post any questions related to Project 2 - TDS Solver . Deadline: Monday, March 31, 2025 6:29 PM\nA: If someone Scrapes the GA Questions with Answers , Can you Please Send them , All of us have might have different GAs (a lil bit maybe), so more data more helpful. PLEASE HELP… Project 2 - TDS Solver - Shared Data Pool Tools in Data Science Project 2 - TDS Solver - Discussion Thread Creating this Thread to share answers and questions from your respective assignments Why? If we can Train the LLM with these Questions already, we can easily do well? Too many Questions for LLM True we can use embeddings, map that stored in-system dictionary and use relevant questions from in-system data to send as context with answer What We need from YOU 🫵🏽\nGet to scraping your respective Gra… @all is it possible to have written solutions to all 5 assignments , instead of just live sessions. I have certain pending questions from the first 5 assignements. Please quickly arrange a live TDS session to explain this project. There are a lot of doubts and questions in our minds."}
{"source": "discourse", "title": "Project 2 - TDS Solver - Shared Data Pool", "url": "https://discourse.onlinedegree.iitm.ac.in/t/169045", "content": "Q: Project 2 - TDS Solver - Discussion Thread Creating this Thread to share answers and questions from your respective assignments Why? If we can Train the LLM with these Questions already, we can easily do well? Too many Questions for LLM True we can use embeddings, map that stored in-system dictionary and use relevant questions from in-system data to send as context with answer What We need from YOU 🫵🏽 Get to scraping your respective Graded Assignments and post the it? How? If answers are saved, Just Print (Ctrl+P) and save pdf, not really if this would work If you had saved code for each question, send the saved code and with a docstring as the question , This would be useful Where? github.com/ANdIeCOOl/TDS-Project2-QuestionBank README.md main # TDS-Project2-QuestionBank\nQuestion Bank for all TDS assignments\n\n# Requested format\n## Student Assignments Directory Structure\n\nEach student has a folder named with their roll number. Inside each student's folder, there are multiple assignment folders (`Assignment_X`). Each assignment contains:\n- A `.txt` file with the question statement.\n- A corresponding `.py`, `.sh`, or `.js` file for the solution.\n\n### Example Directory Structure\nRollNo_12345/\n├── Assignment_1/\n│   ├── Q1.txt    # Question for Q1\n│   ├── Q1.py     # Solution in Python\n│   ├── Q2.txt    # Question for Q2\n│   ├── Q2.sh     # Solution in Bash\n│   ├── Q3.txt    # Question for Q3\n│   ├── Q3.js     # Solution in JavaScript\n├── Assignment_2/ This file has been truncated. show original Please note, Please send the code it would make the LLM more idk “better” Cheers, Andrew out. @all\nA: This time I’ll create a functioning script way before deadline for everyone to use . Hi @23f1002382 Great initiative, will be happy to see lot of PR’s on your repo. Jivraj: e, will be happy to see lot of PR’s on your re Will Hopefully …"}
{"source": "discourse", "title": "Disparity in TDS GA 5 scores", "url": "https://discourse.onlinedegree.iitm.ac.in/t/169247", "content": "Q: My TDS GA score is showing 0,whereas when i open the assignment it is showing last saved score 7.\nA: Can you provide your roll no. We can then check your GA5 Hi @Pranjal085 I have checked your GA5 submission and you have submitted it past the deadline on the 22nd. Kind regards"}
{"source": "discourse", "title": "Graded assignment 6", "url": "https://discourse.onlinedegree.iitm.ac.in/t/169283", "content": "Q: Please post any questions related to Graded Assignment 6 - Data Analysis Please use markdown code formatting (fenced code blocks) when sharing code (rather than screenshots). It’s easier for us to copy-paste and test. Deadline 2025-03-15T18:30:00Z\nA: The answer choices for questions 1 and 2 in graded assignment 6 are quite confusing. Both questions are single-select, yet three out of the four options are correct in each case. I’m unsure whether to choose one of the correct options or if the question is actually asking for the incorrect one. Could someone please clarify? @carlton @Jivraj @Saransh_Saini I have similar concern For Q1, I used the following code: print(f'Pearson correlation for Karnataka between price retention and column')\nkk = df[df['State'] == 'Karnataka']\nfor col in ['Mileage (km/l)', 'Avg Daily Distance (km)', 'Engine Capacity (cc)']:\n    pearson_corr = kk['price_retention'].corr(kk[col])\n    print(f'\\t{col:25} : {pearson_corr:.2f}') And got the following output: Pearson correlation for Karnataka between price retention and column\n\tMileage (km/l)            : 0.03\n\tAvg Daily Distance (km)   : -0.06\n\tEngine Capacity (cc)      : -0.04 Whereas options are below where none of them are correct. image 281×219 9.1 KB Whereas for Q2 (Punjab and Yamaha) I used the following code: print(f'Pearson correlation for Punjab and Yamaha between price retention and column')\npb = df[(df['State'] == 'Punjab') & (df['Brand'] == 'Yamaha')]\nfor col in ['Mileage (km/l)', 'Avg Daily Distance (km)', 'Engine Capacity (cc)']:\n    pearson_corr = pb['price_retention'].corr(pb[col])\n    print(f'\\t{col:25} : {pearson_corr:.2f}') and got the following answers: Pearson correlation for Punjab and Yamaha between price retention and column\n\tMileage (km/l)            : 0.24\n\tAvg Daily Distance (km)   : -0.06\n\tEngine Capacity (cc)      : -0.08 The options for Q2 are given below and 2 of them are correct (AvgDistance and Mileage). image 278×216 9.19 KB @24f2006061 We are looking into it. We will update based on our analysis. Thanks for letting us know. Kind regards"}
{"source": "discourse", "title": "Solve this roe mistake pls", "url": "https://discourse.onlinedegree.iitm.ac.in/t/169352", "content": "Q: image 2559×1599 385 KB can any one tell me why still it shows me that i miss exam although i pass it with 8.\nA: Did you submit before 1:47? If yes, then your highest score will be taken. If not then, you will be marked absent."}
{"source": "discourse", "title": "Programming Quiz 1 in Student Dashboard (label for ROE scores) - showing absent or incorrect", "url": "https://discourse.onlinedegree.iitm.ac.in/t/169369", "content": "Q: Hey, It’s showiing Absent for Programming Quiz 1, But i submitted it successfully. Is this because of any glitch? Anyone of you having the same error?\nA: same problem with  me image 382×386 19 KB Dear Sir, I would like to bring this to your attention that even though I submitted the ROE multiple times, the dashboard is showing absent. I hope the issue will be resolved at earliest as I am not the only one facing this issue Screenshot 2025-03-07 212639 524×386 47.4 KB Hi @carlton @Jivraj sir, I wanted to bring to your attention that, although as you are already aware that I was present for the ROE and successfully submitted my exam, my dashboard currently reflects my status as “Absent.” I have attached a screenshot for your reference. I assume this might be a backend issue or that the scores are still being updated. Could you kindly look into this and confirm? Thank you 1000032712 1080×1032 90.3 KB"}
{"source": "discourse", "title": "Clarification on Passing Criteria for TDS – January 2025 Term", "url": "https://discourse.onlinedegree.iitm.ac.in/t/169807", "content": "Q: Hi Carlton, I am writing to confirm the basic requirements for successfully completing the course. As I understand, the criteria for passing are: Achieving a score greater than 40 marks in the graded assignments. Securing more than 40 marks in the end-term examination. Could you kindly confirm if this understanding is accurate? Additionally, please let me know if there are any other prerequisites to be met.\nA: Best 2/5 first weekly GA >=40 Final course score T = 0.15GAA + 0.2 ROE1 + 0.2 P1 + 0.2P2 + 0.25F Final T >= 40 (or less depending on any certificates for disabilities/SCST/OB etc.)"}
{"source": "discourse", "title": "GA7 - Data Visualisation - Discussion Thread [TDS Jan 2025]", "url": "https://discourse.onlinedegree.iitm.ac.in/t/169888", "content": "Q: Dear Learner, This is the discussion thread for Graded Assignment 7 . Please post any queries related to it here. Deadline: 2025-03-26T18:29:00Z\nA: Is it compulsory to use microsoft powerpoint? Can we use google slides? We will be using scripts to check the submissions. You will have to use PowerPoint. Kind regards Hi @carlton , I was working on GA7 as part of Task 4 in 7.1. In task 4.Sheet1, the columns include Series ID, Item, Year, Month, and Value. While I could extract Series ID and Item, I couldn’t locate Year, Month, or Value in the dataset. Could someone please assist me with this? image 1393×657 67.8 KB"}
{"source": "discourse", "title": "Problem with TDS GA Scores", "url": "https://discourse.onlinedegree.iitm.ac.in/t/170131", "content": "Q: In every TDS assignment after the first, I have not seen a submit button in the assignment page so I could not submit it there( I see it in the sanand portal and submit it there) Now, my assignment score for all assignments (2,3,4,5) shows 0 I am attaching SS of my assignment-5 page to show there was no submit button available there I had raised this as a ticket in the Support desk(21/Feb) in the past as discourse was not available to me at that time, but this didn’t get resolved. I saw a similar older thread where it was mentioned that this is not something to worry about but now it is showing in the portal that I am not allowed to take the End Term Exam. What can be done for this? SS 1895×1010 167 KB\nA: @22f3001561 GA5 like all the prior GAs for TDS Jan 25 term were all to be submitted through the graded assignment page. Which is in the link provided (it is actually in the screen shot you have provided). All the previous GA 1 through 4 were also exactly the same. We have no evidence you ever submitted any of the other GAs except GA1. Kind regards"}
{"source": "discourse", "title": "Concerns Regarding Various Issues: Graded Assignments, Project Doubts, and ROE Score Updates", "url": "https://discourse.onlinedegree.iitm.ac.in/t/170147", "content": "Q: @s.anand @carlton @Jivraj Dear TDS Team, I hope you are doing well. I am writing to highlight several issues and doubts related to different aspects of the course that require clarification and resolution. 1. Graded Assignments (GA) GA6 Doubts Unresolved: While doubts related to Q1 and Q2 have been addressed, other queries remain unresolved despite being posted in the GA6 thread . The deadline has passed, but no solutions have been provided. (Thread link) GA Platform Changes: Initially, we were solving questions on exam.sanand.workers.dev . However, in GA6, we moved to Seek and in GA7, to Google Forms . The issue is that in GA6, we cannot check our answers like we could in previous assignments. 2. Project Updates Project 1: The result is still awaited, although it was expected on or before March 16. Any update on this would be helpful. Project 2: There are multiple doubts posted in the Project 2 discussion thread, but they have not been addressed yet. Without these clarifications, it is difficult to proceed with the project. Could you please provide an expected timeline for when these queries will be resolved? (thread link) 3. ROE Score Update While ROE scores may not be a primary concern, the bonus marks in ROE have still not been updated on the student dashboard. It would be helpful to get confirmation on when these will be reflected. I appreciate your time and assistance in addressing these concerns. Looking forward to your response. Best regards, Lakshay\nA: tigertds 212×148 6.99 KB @carlton It’s been over a month, and now an extra day has been taken as well—when will TDS Project 1 finally be released? The delay is getting excessive; some clarity on the timeline would be appreciated. lakshaygarg654: GA Platform Changes: Initially, we were solving questions on exam.sanand.workers.dev . However, in GA6, we moved to Seek and in GA7, to Google Forms . The issue is that in GA6, we cannot check our answers like we could in previous assignments. The course is in transition. Initially all of it used to be on seek portal. But there were limitations of seek portal that we were not able to work around to deliver the kind of interactive, reactive and rapid corrections/iterations that are now possible because we moved the evaluations from the seek portal to the TDS server. Since the move to the new TDS server on the back end, we are able to also directly see students actual parameterised questions whenever doubts are raised. This is NOT possible on seek portal for us. The results are immediate to see. You got timely rapid feedback for GA 1 to GA 5 from the TAs. The TAs were also able to iterate quickly in discussion with the instructors and the professor as well as operations. With GA 6 our inability to actually see your individual question sets immediately (its possible, but it has to take a very circuitous route via 3 set of people) meant we were always on the back foot for both, checking the answers, as well as making any corrections. And since the questions were parameterised, for technical reasons it was extremely cumbersome/risky/impossible to make changes without it being VERY disruptive to all students. These were some of the reasons we are transitioning. We have seen this problem term after term in prior terms with regards to the seek portal. This is a technological limitation of the current seek portal that directly impacts our ability to react to a dynamic course like TDS. GA 7 was decided to submit via forms again for the reasons listed above. GA6 was straightforward because it was a traditional evaluation. Whereas GA7 is once again very unique and does not handle well in being configured in Seek Portal. Since it was not possible in such a short time to transition GA7 to our preferred hosting server and student favourite, we opted for the least disruptive solution that we are able to action very quickly upon. lakshaygarg654: Project 1: The result is still awaited, although it was expected on or before March 16. Any update on this would be helpful. Project 1 evaluations is VERY computationally intensive for us to evaluate. Each project although dockerised, with an average submission weighing at 2GB, we have to provision space of 1 TB along with the cloud computer resources for all of that (RAM and vCPUs) and if you thought creating project 1 was tough, you can imagine the technical challenge involved in evaluating the 600+ submissions with all the errors and issues we have to fix. In truth its all hands on deck for us here on the back end because it has been deemed critical. So while we are moving the course along, we are also aware that evaluations are at serious risk of missing crucial deadlines. We are taking the matter with utmost seriousness. Its just that we cant always keep you up to date on every set back we are facing. Each and everyone of us are concerned about Project 1 and are working on it. Anand, JK, Prasanna, myself, Jivraj and Saransh. We all have been given access to the eval server which we only managed to provision a few days ago and we are all trying to get the most ambitious TDS project evaluation out the dry dock and into the water and hoping it floats gracefully rather than sink in the estuary. Meanwhile we are busy patching the pipes in the belly of the ship while its rolling down the slipway. lakshaygarg654: 3. ROE Score Update While ROE scores may not be a primary concern, the bonus marks in ROE have still not been updated on the student dashboard. It would be helpful to get confirmation on when these will be reflected. You got the maximum possible mark in ROE. Does it not show you got 100 in ROE in the dashboard? I have been told by operations that it has been pushed. Kind regards We do not know yet. Please read reply to the original poster. Thanks, Kind regards"}
{"source": "discourse", "title": "GA4 bonus marks", "url": "https://discourse.onlinedegree.iitm.ac.in/t/170309", "content": "Q: Sir, I haven’t received bonus marks in ga4 as, i posted queries in discourse regarding ga4. I have scored 8 marks in ga4, but after bonus marks it should be 9, but in dashboard it is showing only 80 marks. Kindly, update my marks in dashboard. @carlton , @Jivraj , @Saransh_Saini\nA: Hi @Sakshi6479 , You have not followed the instruction in GA4 for the bonus mark. Screenshot 2025-03-18 at 11.02.31 am 2566×224 23.2 KB We were given the list by Anand for all those that followed this instruction. That is why you have not received the bonus mark for GA4. Kind regards"}
{"source": "discourse", "title": "[TDS JAN 25] Imp. Announcement for Project 2", "url": "https://discourse.onlinedegree.iitm.ac.in/t/170413", "content": "Q: Dear Learners, Prof. Anand Live Session Alert! Date & Time: Wednesday, March 19, 2025 · 9:00 – 10:00 PM (IST) 2025-03-19T15:30:00Z Speaker: Professor Anand ( @s.anand ) Topic: Project 2 Q&A + General Course Queries Google Meet Link: Join Here How to Prepare for the Live Session Ask Questions in Advance  on THIS thread If you have doubts about Project 2 , post your specific questions in this thread. Struggling to phrase your question clearly? Use the TDS GPT Assistant to refine your question before posting. TDS GPT Assistant Please keep this thread clean and do not use it for banter or solutions. Its only for questions. Check if someone else has already asked the question before posting. Instead just use a thumbs up. If you still feel the question has not been asked exactly the way you would frame it, then go ahead and ask it. Continue Using the original Project 2 Discussion Thread for solutions The Project 2 Discussion Thread is still available for peer and faculty support. Discussion Thread Link Purpose of This Thread Prof. Anand will review questions in advance to ensure an effective live session. Please post only relevant, well-structured questions here. Don’t miss this opportunity! Get your questions ready and join the session. Kind regards, TDS Team\nA: Hi @carlton , Will this session be recorded and shared later? It conflicts with live session of BA and that session is specially told that It will not be recorded. @carlton sir, I too prefer a recording. I did not even attend the session due to personal work which I couldn\"t avoid. Pls support @kushabarodekar @Muthupalaniappan As usual recording will be uploaded to youtube."}
{"source": "discourse", "title": "Successfully Completed TDS Project 2 – Seeking Feedback & Demonstration Session", "url": "https://discourse.onlinedegree.iitm.ac.in/t/171054", "content": "Q: @s.anand @carlton @Jivraj @Saransh_Saini I would like to share that we have successfully completed TDS Project 2 , solving 46/57 cases dynamically via Azure after deployment ! We also tested it with our friends’ GA questions , and it’s working as expected. This project was a team effort by me and two friends [ @lakshaygarg654 and @23f2004637 ], and we are thrilled with the results post-deployment. I would love the opportunity to demonstrate our project to TA and Anand Sir in a Google Meet session on March 31st (since I have OPPE on the 29th and 30th). If you can spare some time for a quick look at our project, it would be awesome! Looking forward to your response.\nA: Hi @23f2005702 @lakshaygarg654 Firstly, congratulations on your success. And surely you can demonstrate your project. It would be great if you demonstrate it in today’s live session at 8pm. Otherwise next week is all about project 2 discussion. Thank you for the opportunity! However, I won’t be able to present the project in a public session as my Azure API URL would be exposed , and since it incurs costs per usage , I need to keep it secure. I’d prefer a private meet to demonstrate the project. Please let me know if that can be arranged. Looking forward to discussing it! That’s amazing @23f2005702 , so far I have completed till 44 Qs and deployed it on azure too !! Mine is solving around 40 correctly out of these 44 (checked with another user’s login on the portal)."}
{"source": "discourse", "title": "Tds-official-Project1-discrepencies", "url": "https://discourse.onlinedegree.iitm.ac.in/t/171141", "content": "Q: Please post any discrepancies related to project1. @carlton Who were evaluated? How did we decide what to evaluate? All the image ids we evaluated were what you submitted to us. This is the list of docker repos that was given to us by @s.anand as the official list that met all the pre-requisites of Project 1. Therefore we will only evaluate those on this list who are eligible for evaluation with the repos you gave us. For clarity. Your docker repo gets a unique id every time it is changed. We will ONLY evaluate the image id which was present at the time of the docker repo being pulled. This acts as a time stamped frozen version of your repo. No other image id will be evaluated. How to fix bugs in our scripts Create Pull requests to Jivraj-18/tds-jan25-project1 . Docker Image Architecture Issue Report If your Docker image was run on the wrong architecture, please fill out this form: Submit Report Bug fixes If you find bugs in our evaluation scripts, you might benefit from more marks because of the bug fix. So it is in your interest to look through our scripts and logs and identify bugs or anomalies. You might just go from 0 to heros. Kind regards, TDS Team\nA: What is the highest mark anyone has scored? Is it 22/20 @Carlton ? How come me and my group used same code but some got 10 some 11 some 12? @carlton Please make clear what the average marks are, what highest marks are, and how the project will be evaulated. We are very close to the end semester exam, and we are still not clear on assignment and project marks. It is a bit frustrating to plan in such circumstances."}
{"source": "discourse", "title": "Project 2: How to test questions from the GA's", "url": "https://discourse.onlinedegree.iitm.ac.in/t/171422", "content": "Q: Hello everyone, I have completed a working project of P2, but I want to test it out with actual questions from the GA’s. Is there anyone that can provide with sample question structure, or 1 or 2 questions as a form of ‘test cases’ so that we can try and fix our project? Thank you very much in advance Aryan Singh\nA: You can do a curl post request or use something like Thunderclient or Postman. If you used fastapi then in the /docs path of your link you will find the open API user interface which you can also use for testing."}
{"source": "discourse", "title": "Request for Extension on TDS Project 2 Deadline", "url": "https://discourse.onlinedegree.iitm.ac.in/t/171428", "content": "Q: I am really facing difficulty completing Project 2 on time as we had our OPPE exam yesterday, and the past week was dedicated to preparing for it. Additionally, due to an unforeseen emergency, I was unable to write the ROE exam, which resulted in lost marks. This makes it even more crucial for me to perform well in this project to make up for it. I sincerely request if it would be possible to extend the deadline by 2 days. This would allow me to put in my best effort and submit quality work. I truly value this opportunity and would be extremely grateful for your consideration. Thank you for your time and understanding.\nA: A little more time will help us deploy properly as well. @carlton @Jivraj please allow for some more time. Even when working in groups and mixing and matching code… the real messy work is debugging and deployment due to the sheer variety of it. Some are deploying on AWS, some on scalingo, some on Digitalocean, some on Render, some on Azure… even helping amongst ourselves is getting complex because of this."}
{"source": "discourse", "title": "Project 1 Evaluation second mail is not correct and reports files missing while they are present", "url": "https://discourse.onlinedegree.iitm.ac.in/t/171477", "content": "Q: Mail I received Yesterday: Screenshot from 2025-04-01 09-01-07 1174×451 54.2 KB Previous Correct Evaluation Mail: Screenshot from 2025-04-01 09-02-35 1687×650 144 KB Good Morning Sir, This is my github repo: GitHub - kohliaryan/TDS_Project_1 ()You can verify that it is public, MIT License is present and Dockerfile is also present.) I also got a mail 2 days ago in which everything is mentioned correctly but the mail I got yesterday worry me.  Sir, I have worked really hard for project 1. Please look into this matter. @carlton\nA: @Jivraj Sir, Please look into in this matter, no reply from your side till now and 2 days have been passed. Apologies for that, The second email was an automated script that used a stricter criteria. You have passed evaluation and also have a score. So dont worry. We will push scores over this weekend. We are currently doing normalisation. Kind regards Hi @carlton , I’m experiencing the same issue mentioned in this thread regarding Project 1 evaluation emails: The first email I received confirmed all requirements were met (public repo, MIT License, Dockerfile, etc.) The second email incorrectly flagged missing files despite their presence in my repository Here are screenshots of both emails showing the discrepancy: First Evaluation Email 1511×724 76.2 KB Second Evaluation Email 1247×681 37.5 KB My GitHub repo remains publicly accessible with all required components: GitHub repo Could you please confirm this was an automated error and that my submission will be evaluated based on the actual repository contents? Your clarification would be greatly appreciated. Thank you for your time and assistance!"}
{"source": "discourse", "title": "Project 1 discrepancy regarding mit license", "url": "https://discourse.onlinedegree.iitm.ac.in/t/171485", "content": "Q: Sir, The License file is present in the github repository however i received a mail that said that it was absent. image 1145×673 33.8 KB image 633×336 7.1 KB Sir I thought that the ‘LICENSE’ file had to be renamed to ‘MIT LICENSE’. Can you please look into it. Thankyou!\nA: Hi @22f3000585 Standard MIT License naming criteria is to be named as LICENSE or LICENSE.md(all caps). Adding a license to a repository - GitHub Docs Kind regards image 931×108 3.89 KB Sir, this is why i renamed it to ‘MIT LICENSE’. Sir can you please consider it. Thank you! Same here. I also added and saved the file as MIT license because of the following message. I request you to please consider evaluating the project. Screenshot 2025-04-02 at 4.49.23 PM 1776×228 15.5 KB"}
{"source": "discourse", "title": "TDS - GA7 - Score missing", "url": "https://discourse.onlinedegree.iitm.ac.in/t/171500", "content": "Q: I have submitted GA 7 in TDS multiple times, inspite of this it is showing not submitted. Please inspect\nA: @carlton @POD_TEAM how to peer review for GA7 where is the link?? Dont worry about seek portal. GA 7 scores will only get pushed once peer reviews are done. (roughly 3 days before end term). Kind regards @carlton @Jivraj What is to be done if the student in question has not done a question? We are required to fill an answer in the quantitative part. We can’t leave it blank."}
{"source": "discourse", "title": "Clarification on API Endpoint Correction in Submission", "url": "https://discourse.onlinedegree.iitm.ac.in/t/171525", "content": "Q: @s.anand @carlton @Saransh_Saini @Jivraj I submitted the form before the deadline with the API endpoint as /api, but I later realized the correct format was /api/ (with a trailing slash). To fix this, I edited the Google Form today. Will this cause any issues with the submission? Please let me know if any further action is needed.\nA: It is not like that, it can be any endpoint, but whatever you submit should work. Like many frameworks treat /api/ and /api differently. The project 2 docs assumes that the endpoint is /api/ and provides the code accordingly. you are right but if I use postman with /api end point it wont work but with /api/ it will work so.. @Saransh_Saini Here is the tag And roll number  of people in collaboration with our project 21f3001076@ds.study.iitm.ac.in 23f2005702@ds.study.iitm.ac.in 23f2004637@ds.study.iitm.ac.in 23f2005702@ds.study.iitm.ac.in"}
{"source": "discourse", "title": "Peer review clarificaiton", "url": "https://discourse.onlinedegree.iitm.ac.in/t/171541", "content": "Q: I am unable to open the files shared by the students I am peer reviewing as I don’t have access to them on my student email. Since we were asked to give access to se2002@study.iitm.ac.in when submitting, I wanted to check how this will work—will the team provide us access, or do we need to request it from the student and wait for them to grant it?\" @carlton\nA: If u dont have access to the google sheet of ur peer while trying reviewing , it means u can just give them 0 and leave (mentioned in the mail they sent ) Request access from the peer. Also dont forget to give view permissions to your submissions. Kind regards I have completed my allotted 3 peer reviews, I was wondering if it’s possible to do more peer reviews for extra credit? I ask because all 3 of my allotted peer reviews were empty submissions and I don’t feel like I actually did any work"}
{"source": "discourse", "title": "End term TDS", "url": "https://discourse.onlinedegree.iitm.ac.in/t/171668", "content": "Q: @carlton can you give me some advice regarding preparation for end term exam.\nA: any question papers for preparations and on what basis the questions would come @carlton @Jivraj @Saransh_Saini Hi, We have 6 days for ET. I request you to share module weightage (if it’s not secret). Please release mock as early as possible because this term course content has been changed so pyqs won’t help much. Thanks Sujay D @carlton , please release the mock or give us the proper resources. The resources in the course introduction and the pyqs have no similarities. Many questions come from other topics, such as MLT and many others. Those who didn’t complete it find it too difficult. Please don’t keep us in delusion."}
{"source": "discourse", "title": "Why Failed?", "url": "https://discourse.onlinedegree.iitm.ac.in/t/171672", "content": "Q: Screenshot 2025-04-03 161302 1268×533 16.3 KB virajpitale/tds-project1 on github you can clearly see i added mit license still it is showing failed\nA: image 1480×950 140 KB I checked your github repo MIT License file is named as Licenese.md but standard naming for License is LICENSE or LICENSE.md (with all caps). So, should I edit the filename now, or will you count it as missing? @Jivraj please reply"}
{"source": "discourse", "title": "Repeat course", "url": "https://discourse.onlinedegree.iitm.ac.in/t/171798", "content": "Q: Even if I pass in end term TDS, Can I repeat the course in next term because I missed project1 and my CGPA will go down because of it? This is my last term of diploma. So, can I take 1 diploma course and rest degree courses in next term?\nA: Yes, you can. More details given in student handbook. Search for repeat courses. 1000433920 1079×398 104 KB TDS is the worst subject to repeat in order to improve CGPA. Its better to take a high credit, easy course to improve CGPA. We never recommend taking TDS for grade improvement. If you have passed it, its better to move on. @carlton Sir, It is my humble request to kindly give atleast 2 bonus marks like any other subject, if i will get 2 marks as bonus my grade will stay good otherwise it will fall badly. Sir plzzz it is my request."}
{"source": "discourse", "title": "Project 1 solution repository link", "url": "https://discourse.onlinedegree.iitm.ac.in/t/171999", "content": "Q: Can anyone share the link to project 1 solution github repo.\nA: The repo has not been made public. But until that happens, we are allowed to share the solution. Just name the script app.py, build the docker image according to test environment. This also happened to be the highest scoring script getting 19 tasks correct. # /// script\n# requires-python = \">=3.11\"\n# dependencies = [\n#   \"fastapi\",\n#   \"httpx\",\n#   \"uvicorn\",\n# ]\n# ///\n\nfrom fastapi import FastAPI, HTTPException\nfrom fastapi.staticfiles import StaticFiles\nfrom fastapi.responses import FileResponse\nimport os\nimport httpx\nimport re\nimport asyncio\n\napp = FastAPI()\napp.mount(\"/static\", StaticFiles(directory=\"static\"), name=\"static\")\n\ntoken = os.environ[\"LLMFOUNDRY_TOKEN\"]\n\n\nasync def llm(system_prompt: str, user_prompt: str) -> str:\n    \"\"\"Call GPT-4o-Mini via AI Proxy.\"\"\"\n    async with httpx.AsyncClient(timeout=30.0) as client:\n        response = await client.post(\n            \"https://llmfoundry.straive.com/v1/chat/completions\",\n            headers={\"Authorization\": f\"Bearer {token}\"},\n            json={\n                \"model\": \"gpt-4o-mini\",\n                \"messages\": [\n                    {\"role\": \"system\", \"content\": system_prompt},\n                    {\"role\": \"user\", \"content\": user_prompt},\n                ],\n            },\n        )\n        response.raise_for_status()\n        return response.json()[\"choices\"][0][\"message\"][\"content\"]\n\n\nsystem_prompt = \"\"\"The user will provide a task description.\nWrite one or more `bash` or `python` scripts to execute the task.\n\nCODING RULES:\n\n- uv, the Python runner, is ALREADY installed. Run with `uv run [URL] [ARGUMENTS]`\n- Parse dates with `python-dateutil`\n- Sender email is in the `From: \"Name <email@...>` header\n- When removing a prefix (e.g. `/data/docs/`) from a path, retain the path after the prefix\n- Call an LLM via a POST request to `https://llmfoundry.straive.com/openai/v1/chat/completions` with `Authorization: Bearer {os.getenv(\"LLMFOUNDRY_TOKEN\")}` and this JSON body:\n    {\n      model: \"gpt-4o-mini\",\n      messages: [\n        { role: \"system\", content: \"[INSERT SYSTEM PROMPT]\" },\n        { role: \"user\", content: [\n        { type: \"text\", text: \"[INSERT USER MESSAGE]\" }, // for text\n        { type: \"image_url\", image_url: { url: `data:[IMAGE MIME TYPE];base64,[IMAGE BASE64]`, detail: \"low\" } }, // for image. Get MIME type DYNAMICALLY from image\n        ]}\n      ],\n      // response_format: \"json_object\",  // forces JSON response\n    }\n  Response is in `response.choices?.[0]?.message?.content`. Error is in `response.error?.message`.\n- Calculate embeddings with a POST request to `https://llmfoundry.straive.com/openai/v1/embeddings` with `Authorization: Bearer {os.getenv(\"LLMFOUNDRY_TOKEN\")}` and this JSON body:\n    {\n      model: \"text-embedding-3-small\",\n      input: [array of strings],\n    }\n  Embeddings are in response.data[*].embedding - an array of floats.\n  Calculate the dot product of the embeddings (skipping the diagonal) to find the most similar pair of strings.\n\nclient.post(\n            f\"{openai_api_base}/embeddings\",\n            headers={\"Authorization\": f\"Bearer {openai_api_key}\"},\n            json={\"model\": \"text-embedding-3-small\", \"input\": data},\n        )\n- When extracting card information, use the system prompt \"Extract the EXACT dummy credit card number from this test image\"\n\nEXECUTION RULES: An automated agent will blindly run the scripts you provide. So ONLY\nwrite the FINAL script(s) to run in ```bash or ```python code fences.\n\"\"\"\n\n\n@app.post(\"/run\")\nasync def run_task(task: str):\n    \"\"\"Execute a plain-English automation task.\"\"\"\n    response = await llm(system_prompt, task)\n    print(f\"\\n🟡 Running task:\\n{task.strip()}\\n\")\n    print(f\"\\n🟡 {response}\\n\")\n\n    results = []\n    for language, code in re.findall(r\"```(python|bash)\\n(.*?)\\n```\", response, re.DOTALL):\n        print(f\"\\n🟡 Running {language} code:\\n{code}\\n\")\n        if language == \"python\":\n            result = await execute_python(code)\n        else:  # bash\n            result = await execute_bash(code)\n        results.append({\"lang\": language, **result})\n\n    print(f\"\\n🟡 Results:\\n{results}\\n\")\n    return {\"response\": response, \"results\": results}\n\n\n@app.get(\"/read\")\nasync def read_file(path: str):\n    \"\"\"Read contents of a file.\"\"\"\n    # Validate path is within /data\n    path = os.path.normpath(path)\n    if not path.startswith(\"/data/\"):\n        raise HTTPException(status_code=400, detail=\"Invalid path\")\n    if not os.path.exists(path):\n        raise HTTPException(status_code=404, detail=\"File not found\")\n    return FileResponse(path)\n\n\n@app.post(\"/execute/python\")\nasync def execute_python(code: str):\n    \"\"\"Execute Python code directly.\"\"\"\n    proc = await asyncio.create_subprocess_exec(\n        \"python3\",\n        \"-\",\n        stdin=asyncio.subprocess.PIPE,\n        stdout=asyncio.subprocess.PIPE,\n        stderr=asyncio.subprocess.PIPE,\n    )\n    stdout, stderr = await proc.communicate(code.encode())\n\n    if proc.returncode != 0:\n        print(f\"\\n🔴 Python execution failed:\\n{stderr.decode()}\")\n        raise HTTPException(status_code=500, detail=f\"Execution failed: {stderr.decode()}\")\n\n    return {\"stdout\": stdout.decode(), \"stderr\": stderr.decode()}\n\n\n@app.post(\"/execute/bash\")\nasync def execute_bash(code: str):\n    \"\"\"Execute bash code directly.\"\"\"\n    proc = await asyncio.create_subprocess_exec(\n        \"bash\",\n        stdin=asyncio.subprocess.PIPE,\n        stdout=asyncio.subprocess.PIPE,\n        stderr=asyncio.subprocess.PIPE,\n    )\n    stdout, stderr = await proc.communicate(code.encode())\n\n    if proc.returncode != 0:\n        print(f\"\\n🔴 Bash execution failed:\\n{stderr.decode()}\")\n        raise HTTPException(status_code=500, detail=f\"Execution failed: {stderr.decode()}\")\n\n    return {\"stdout\": stdout.decode(), \"stderr\": stderr.decode()}\n\n\n@app.get(\"/\")\nasync def read_root():\n    \"\"\"Serve the index.html file.\"\"\"\n    return FileResponse(\"static/index.html\")\n\n\nif __name__ == \"__main__\":\n    import uvicorn\n\n    uvicorn.run(app, host=\"0.0.0.0\", port=8000)"}
{"source": "discourse", "title": "EMAIL IN ga-7", "url": "https://discourse.onlinedegree.iitm.ac.in/t/172021", "content": "Q: @carlton sir in google form it is written to submit email address of peer but the mail TDS team has sent has 3 drive links .so we have to submit drive links or like create the email by adding “ @ds.study.iitm.ac.in ” after the username\nA: If you actually open the drive link you will see the student email. You have to use that email for submitting the form."}
{"source": "discourse", "title": "Bonus Marks in TDS for Jan 25", "url": "https://discourse.onlinedegree.iitm.ac.in/t/172246", "content": "Q: @carlton @Jivraj @Saransh_Saini Greetings sir! Sir, I have a query about the criteria for earning bonus marks in the TDS course. I’ve noticed that some students who completed GA7 are receiving bonus marks for extra peer reviews (5 bonus marks is quite significant as it improves grades as well). However, what about those of us who completed all 6 assignments but missed GA7 for some reason? As the course is quite challenging due to the vast syllabus, bonus marks would be really helpful for many of us. Could you kindly clarify the situation? Thank you and Regards Akshit\nA: Yes, I also missed the same assignment due to pressure from other courses. However, awarding a 5-mark bonus instead of a percentile-based system like GA4 seems quite different. Is this information available to everyone @carlton sir? Hello @carlton @Jivraj @Saransh_Saini @s.anand sir, I hope you are doing well. As per the grading document, we were informed that only the best 4 out of the 7 assessments would be considered for grading. However, there was no mention of bonus marks, and before the deadline, we were not informed about the +5 bonus marks for GA7. Due to other academic commitments, such as Project 2, some of us were unable to complete GA7. Now, we have come to know that some of our peers have received an email stating that they have been awarded +5 bonus marks, which directly contribute to the final score. In some cases, this may even impact the final grade. Since this information was not communicated earlier, we kindly request you to consider providing an alternative way for those who missed GA7 to earn these bonus marks—perhaps through reviewing submissions or another form of assessment. We sincerely request your understanding on this matter and would be grateful if you could provide an opportunity for us to earn the bonus marks as well. Looking forward to your kind consideration. Best regards, Digvijaysinh Chudasama The Same happened to me. They should have informed this before."}
{"source": "discourse", "title": "📜 According to TDS Rule 14(b):", "url": "https://discourse.onlinedegree.iitm.ac.in/t/172254", "content": "Q: @s.anand @carlton @Saransh_Saini @Jivraj “Students are allowed to take help from their pets in completing assignments.” So I did. Confession: My Labrador Did All My Assignments Yes, I got great marks in Assignments, ROEs, and Project 1. But let’s be real… It was my Labrador who did the actual work While I was snoozing through deadlines, he was: Solving deployment issues faster than my dev server boots Writing function calling code like a true GPT whisperer Fixing LLM bugs that I didn’t even understand Meanwhile, I was just vibing in my blanket. He growled at broken APIs. I took the credit. Message from the Dog Developer: “Thank you all for an awesome semester! I learned more than some juniors. From containerization to prompt tuning. But I am personally offended by one thing…” “How dare you give bonus marks on Week 7 ? I skipped it — just like many — because we were told only best 4 of 7 would count . I demand justice. And a belly rub.” – , Full-stack Labrador & Part-time Therapist Moral of the story: Let your pets help with your coursework. You get the grade. They get the rage.\nA: After fighting so much for GA, ROE, Project 1, and Project 2, my inner animal got hurt and fell asleep — and that’s how I ended up missing GA7. Please don’t hurt him any further. Swarna-48 1200×675 15.1 KB I know this is obviously a joke but, is there a rule book by any chance ? I think you feed your dog desi ghee instead of pedigree"}
{"source": "discourse", "title": "END TERM MOCK [TDS Jan 25]", "url": "https://discourse.onlinedegree.iitm.ac.in/t/172333", "content": "Q: Mock Exam: Tools in Data Science The end term and the mock has been created using the TDS GPT Assistant. Since the GPT has ALL the GAs, Course Content Modules, Live Session Transcriptions (its works like RAG), it is really able to help you prepare for the end term. Use it! Therefore you can also create your own mocks. ChatGPT ChatGPT - IITM TDS Teaching Assistant TA for IIT Madras' Data Science course, guiding students with questions. Below are variant questions across various topics relevant to the course. These questions have been curated from the topics areas we are focussing on. Therefore it will be very similar in content to the end term. What it does not contain: Scenario based questions. These are complex to construct. We will address the topics for these questions in the live session. LLMs Pandas Git, Docker, Bash Q1: HTTP Method Semantics Which HTTP method is not idempotent , meaning repeated identical requests may result in different outcomes each time? A. GET B. PUT C. POST D. DELETE Answer : C. POST Q2: IDE Features Which feature is least likely to be found in a standard code editor or IDE? A. Code formatting tools B. Integrated terminal C. Git integration D. Cloud hosting of Docker containers Answer : D. Cloud hosting of Docker containers Q3: Pandas Summary Methods You have a DataFrame with a region column. To get a quick summary of how many entries are in each region, which method is most useful? A. df.describe() B. df[“region”].value_counts() C. df.count() D. df.groupby(“region”).sum() Answer : B. df[“region”].value_counts() Q4: Python Exception Scope You want to safely open a file, handle any errors, and ensure the file is always closed in Python. Which pattern should you use? A. try: open(...) then finally: close() B. open() and then except C. open() and then raise D. Use with open(...) as f: block Answer : D. Use with open(...) as f: block Q5: Chrome DevTools - Debugging A frontend developer wants to trace JavaScript function calls step-by-step. Which Chrome DevTools panel should they use? A. Console B. Application C. Sources D. Elements Answer : C. Sources Q6: Data Cleaning Tools You are cleaning survey responses and want to automatically match similar text entries like “NYC”, “New York City”, and “newyorkcity”. Which approach/tool would be most effective? A. TRIM() in Excel B. Manual Find and Replace C. Fuzzy matching or clustering in OpenRefine D. COUNTIF() Answer : C. Fuzzy matching or clustering in OpenRefine Q7: Geospatial Libraries Which pair of Python libraries is best suited for geospatial analysis and rendering static maps ? A. pandas and seaborn B. geopandas and matplotlib C. folium and flask D. sklearn and dash Answer : B. geopandas and matplotlib Q8: Statistical Significance A psychologist tests if a training program changes memory performance and finds a p-value of 0.08 . What can be concluded at the 0.05 significance level? A. The result is highly significant B. The null hypothesis must be rejected C. There is insufficient evidence to reject the null hypothesis D. The program is proven to work Answer : C. There is insufficient evidence to reject the null hypothesis Q9: Purpose of Kumu What is a key use case for a tool like Kumu ? A. Animating time series B. Designing deep learning models C. Visualizing stakeholder networks and system relationships D. Performing statistical analysis Answer : C. Visualizing stakeholder networks and system relationships Q10: DevTools Performance Diagnostics To diagnose a slow webpage, you want to analyze scripts, rendering times, and long tasks . Which DevTools panel provides a timeline-based view? A. Elements B. Performance C. Network D. Lighthouse Answer : B. Performance Q11: Git Configuration Which of the following files helps configure a Git project’s name, email, and default branch? A. .gitignore B. .gitattributes C. .git/config D. README.md Answer : C. .git/config Q13: Safe HTTP Method Which HTTP method is considered safe , meaning it is only used for retrieval and must not change server state? A. GET B. DELETE C. PATCH D. POST Answer : A. GET Q14: Deduplicating Text Entries A dataset has entries like “IBM”, “I.B.M.”, and “International Business Machines”. What is the best tool to cluster these for cleaning? A. Excel TRIM B. OpenRefine using key collision or fingerprinting C. pandas merge() D. CONCATENATE() Answer : B. OpenRefine using key collision or fingerprinting Q15: Geospatial + Interactive Mapping A conservation biologist wants to visualize real-time animal tracking data on an interactive map. Which libraries would be best? A. geopandas and plotly B. folium and pandas C. seaborn and shapely D. rasterio and altair Answer : B. folium and pandas Q16: Pandas - Filtering Unique Entries You have a DataFrame of customer orders and want to list only those customers who ordered once . Which Pandas method chain is most suitable? A. df.groupby(“customer”).sum() B. df[“customer”].value_counts() == 1 C. df.drop_duplicates() D. df[“customer”].nunique() Answer : B. df[“customer”].value_counts() == 1 Q17: Purpose of Kumu in System Design How does Kumu help in system design or stakeholder mapping? A. Organizing spreadsheets B. Identifying leverage points in complex systems through visual maps C. Rendering line graphs D. Sending notifications Answer : B. Identifying leverage points in complex systems through visual maps Q18: Python Exception - Multiple Handlers Which structure allows Python to handle different types of exceptions separately? A. try … finally B. if … else C. Multiple except blocks D. Nested try blocks Answer : C. Multiple except blocks Q19: Understanding Statistical Power If a study has low statistical power , what is most likely to occur? A. False positive (Type I error) B. False negative (Type II error) C. Confounding D. Multicollinearity Answer : B. False negative (Type II error) Q20: Git Basics - Staging Area Which Git command moves modified files to the staging area ? A. git push B. git add C. git fetch D. git init Answer : B. git add Q21: Chrome DevTools - Local Storage Where can you inspect local storage items (e.g. tokens, preferences) in Chrome DevTools? A. Console B. Application > Local Storage C. Elements D. Sources Answer : B. Application > Local Storage Q22: Chrome DevTools - JS Performance Which DevTools feature helps measure execution time of scripts and CPU usage? A. Console B. Network C. Performance D. Application Answer : C. Performance Q23: Excel Data Import - Scientific Notation Issue You import a CSV file where product IDs like \"1E10\" are being interpreted as scientific notation in Excel. What is the best way to preserve these IDs as text? A. Format the column as General B. Use =TEXT(A1, \"0\") after import C. Set column format to Text during import or Text-to-Columns D. Change regional settings Answer : C. Set column format to Text during import or Text-to-Columns Module: Everyday Tools Q1: Spreadsheet Functions You have a dataset in Excel where column A contains full names in the format “Last Name, First Name”. Which function can you use to extract the first name into a separate column? A. =LEFT(A1, FIND(\",\", A1)-1) B. =RIGHT(A1, LEN(A1) - FIND(\",\", A1)) C. =MID(A1, FIND(\",\", A1)+2, LEN(A1)) D. =SPLIT(A1, \",\") Answer : C — The MID function extracts text from the middle of a string. By finding the position of the comma and adding 2 (to skip the comma and space), it extracts the first name. Option A extracts the last name, Option B results in an error due to incorrect syntax, and Option D is not a valid Excel function. Module: Data Sourcing Q2: Web Scraping Ethics When performing web scraping to collect data, which of the following practices is considered unethical? A. Respecting the website’s robots.txt file. B. Sending requests at a rate that mimics human browsing behavior. C. Scraping data from a website that requires login without permission. D. Citing the source of the data collected. Answer : C — Scraping data from a website that requires login without permission violates the site’s terms of service and user privacy. Options A, B, and D are ethical practices that respect the website’s policies and data ownership. Module: Data Preparation Q3: Handling Missing Data In a dataset, you notice that several entries in the “Age” column are missing. Which method is generally not appropriate for handling these missing values? A. Replacing missing values with the mean age. B. Deleting rows with missing age values. C. Replacing missing values with a fixed age, such as 0. D. Leaving the missing values as they are without any action. Answer : D — Leaving missing values unaddressed can lead to errors in analysis and modeling. Options A, B, and C are common strategies for handling missing data, depending on the context and the extent of the missingness. Module: Data Analysis Q4: Statistical Measures Which of the following statistical measures is not sensitive to extreme values (outliers) in a dataset? A. Mean B. Median C. Standard Deviation D. Range Answer : B — The median represents the middle value of a dataset and is not affected by outliers. In contrast, the mean, standard deviation, and range can be significantly influenced by extreme values. Module: Large Language Models Q5: Tokenization in NLP In Natural Language Processing, what is the primary purpose of tokenization? A. To translate text from one language to another. B. To split text into individual words or subwords. C. To encrypt text for secure communication. D. To summarize large texts into shorter versions. Answer : B — Tokenization involves breaking down text into smaller components, such as words or subwords, which can then be processed by language models. This is a fundamental step in NLP tasks. Module: Geospatial and Network Analysis Q6: Geographic Coordinate Systems Which of the following coordinate systems is commonly used to represent locations on Earth’s surface? A. Cartesian Coordinate System B. Polar Coordinate System C. Geographic Coordinate System (Latitude and Longitude) D. Cylindrical Coordinate System Answer : C — The Geographic Coordinate System uses latitude and longitude to specify locations on Earth’s surface. This system is widely used in geospatial analysis. Module: Data Visualization Q7: Effective Data Visualization When creating a bar chart to compare the sales performance of different products, which practice should be avoided? A. Ordering bars from highest to lowest value. B. Using different colors for each bar without a legend. C. Starting the y-axis at zero. D. Labeling each bar with its exact value. Answer : B — Using different colors for each bar without a legend can confuse the audience, as they may assume the colors represent different categories. Consistency and clarity are key in effective data visualization. Module: Everyday Tools Q8: VS Code Feature Use You are editing a Python script in Visual Studio Code and want to quickly find and edit all occurrences of a variable name in the current file. What feature should you use? A. Git integration B. Debug panel C. Multi-cursor editing D. Terminal commands Answer : C — Multi-cursor editing allows you to place multiple cursors in a file and edit text in multiple locations at once. It is useful for refactoring variable names or repeated patterns. Module: Data Sourcing Q9: Data API Identification Which of the following data sources is most likely to provide structured data accessible via an API? A. A scanned PDF document B. A screenshot of a chart C. The World Bank data portal D. A newspaper article Answer : C — The World Bank data portal provides structured datasets accessible via APIs. The other options involve unstructured or image-based content not suitable for direct data access. Module: Data Preparation Q10: Data Type Conversion in Excel You imported a CSV file into Excel, and one of the columns containing numbers is treated as text. What is the easiest way to convert it into numeric format? A. Use the CONCAT function B. Format the column as Text C. Use the VALUE() function D. Use SUBSTITUTE() Answer : C — The VALUE function converts text that appears as numbers into actual numeric values. This is useful when data is imported with formatting issues. Module: Data Analysis Q11: Outlier Detection You are analyzing a dataset of employee salaries. Which visualization is best for quickly identifying outliers? A. Line chart B. Box plot C. Histogram D. Pie chart Answer : B — A box plot clearly shows the spread of data and highlights outliers as individual points beyond the whiskers. Module: Large Language Models Q12: Prompt Engineering Strategy To get consistent, structured responses from a language model when extracting key information, which approach is most effective? A. Ask the model to “summarize” the text B. Use open-ended questions C. Use system messages and JSON schema formatting D. Provide only one-word inputs Answer : C — System messages and structured output formats like JSON schemas guide the model to generate reliable and consistent structured responses. Module: Geospatial and Network Analysis Q13: Network Centrality In a social network graph of coworkers, which metric best identifies the person who connects the most groups together? A. Degree centrality B. Closeness centrality C. Betweenness centrality D. Eigenvector centrality Answer : C — Betweenness centrality measures how often a node appears on shortest paths between other nodes, highlighting connectors or “bridges” in the network. Module: Data Visualization Q14: Choosing the Right Chart You want to show how the composition of a marketing budget changes across three years. Which visualization is most appropriate? A. Pie charts for each year B. Scatter plots C. Stacked bar chart D. Line chart Answer : C — A stacked bar chart shows parts of a whole across different categories and time periods, making it easier to compare budget composition over years.\nA: @carlton @Jivraj any link for last term’s end term question answer quizpractice.space Practise End Term Quiz Question Papers Practice with IITM's online BS degree question papers and quizzes to improve your preparation. So here is more questions in the form of a little quiz (shared by someone in the group,DM for Credit ) gkmfrombs.github.io Quiz from PDF That has 350 questions if you don’t want to go through all of them(it’s pretty time consuming) in that case just do this PDF.(This pdf contains all the questions that is a bit conceptual i would say and some questions which i failed to do ) accounts.google.com Google Drive: Sign-in Access Google Drive with a Google account (for personal use) or Google Workspace account (for business use). (If you know context to the pdf’s name,we are friends ) Thank you, Kindeeesstt Regards,(hopefully the last post on discourse for TDS), Tushar Jalan"}
{"source": "discourse", "title": "PYQ doubt", "url": "https://discourse.onlinedegree.iitm.ac.in/t/172373", "content": "Q: image 1141×678 102 KB @carlton sir plz review it i think the correct answer should be A\nA: yes saturday is 5 when using weekday ()"}
{"source": "discourse", "title": "What to do if peer has not allowed access and the deadline is over for peer review in Project 2", "url": "https://discourse.onlinedegree.iitm.ac.in/t/172471", "content": "Q: I had been accidentally given a duplicate peer and assigned a new peer on 10th April with the evaluation deadline being 11th April 11:59 PM. I had asked for access to the Google Sheet for question 1 however I have not been given any access and the deadline is up. What to do?\nA: Yes, same for me the links i got has not been accessed to me. I mailed regarding this. So i filled form for most of the peers. I was waiting for the response but didnt get any. @SohamHaldar @21f3000745 We had sent out an email with an extra non - duplicate peer and extended the deadline by a day to accommodate reviewing the extra peer. Please check your email with the subject. [TDS Jan 25] Bonus peer Yes sir, but therein lies the problem, this extra peer (atleast for me) did not give me access to his Google Sheets and now the deadline is over and I could not submit a blank Google form."}
{"source": "discourse", "title": "Project 1 : not submitted issue", "url": "https://discourse.onlinedegree.iitm.ac.in/t/172497", "content": "Q: @carlton sir my project 1 marks are showing not submited. But i did indeed submit it with proper procedure. What should i do ? For my marks update.\nA: Some scores will be pushed to dashboard on or after 14th, they are part of an update score batch. Yours is likely waiting to be pushed. We will give a discrepancy form after endterm. If your score is not showing on dashboard, fill that and operations will have a look. From our side we have a score for you of 55 for Project 1."}
{"source": "coursecontent", "title": "Module: Development Tools", "content": "Development Tools teaches how to build. Refer: development-tools.md"}
{"source": "coursecontent", "title": "Module: Deployment Tools", "content": "Deployment Tools teaches how to publish. Refer: deployment-tools.md"}
{"source": "coursecontent", "title": "Module: Large Language Models", "content": "Large Language Models teaches how to [Data Sourcing](data-sourcing.md). Refer: large-language-models.md"}
{"source": "coursecontent", "title": "Module: Data Preparation", "content": "Data Preparation teaches how to [Data Analysis](data-analysis.md). Refer: data-preparation.md"}
{"source": "coursecontent", "title": "Module: Data Visualization", "content": "Data Visualization teaches how to preponed. Refer: data-visualization.md"}
{"source": "coursecontent", "title": "Module: Seek Notifications", "content": "Seek Notifications teaches how to [Your email](https://mail.google.com/). Refer: https://seek.onlinedegree.iitm.ac.in/"}
{"source": "coursecontent", "title": "Module: TDS Discourse", "content": "TDS Discourse teaches how to Faculty. Refer: https://discourse.onlinedegree.iitm.ac.in/c/courses/tds-kb/34"}
{"source": "coursecontent", "title": "Note: This course exposes you to real-life tools", "content": "Courses teach you programming and data science. From statistics to algorithms to writing Python code to building models.\n\nBut one critical subject that's rarely covered is: what tools should I pick and how do I become proficient in them?\n\nThese tools might not help your CV much. But they will make things easier in real life. For example, at school:\n\n- You learn from pristine datasets. But in the industry, you'll have to scrape them yourself.\n- You learn how to train models. But soon, you'll just pick something from HuggingFace.\n- You learn to write a log parser over weeks. Instead, your boss writes a `sed` + `grep` script in minutes.\n\n[![](https://imgs.xkcd.com/comics/lisp.jpg) \"We lost the documentation on quantum mechanics. You'll have to decode the regexes yourself.\"](https://explainxkcd.com/224/)\n\nIn this course, we've curated the most important tools people use in data science.\n\nLearn them well. You'll be a **_lot_ more productive** than your peers."}
{"source": "coursecontent", "title": "Note: This course is quite hard", "content": "Here's students' feedback:\n\n- [2 out of 5 students in the Jan 2025 batch failed](https://discourse.onlinedegree.iitm.ac.in/t/when-should-i-take-tools-in-data-science/173268)\n- It _used_ to be an easy course until 2024.\n  [#](https://discourse.onlinedegree.iitm.ac.in/t/difficulty-rating-for-diploma-subjects-based-on-students-opinion/61194)\n  [#](https://discourse.onlinedegree.iitm.ac.in/t/difficulty-rating-for-diploma-subjects-2-0-based-on-student-ratings-and-my-experience/85681)\n  [#](https://discourse.onlinedegree.iitm.ac.in/t/what-should-i-take-next/44291/6)\n- Now it's hard and covers more. Take it in your last semester if possible.\n  [#](https://discourse.onlinedegree.iitm.ac.in/t/diploma-course-feedback-t32024-and-course-selection-t12025-thread/160032/45)\n  [#](https://discourse.onlinedegree.iitm.ac.in/t/2024-t1-diploma-level-feedback-and-course-selection-for-may-2024-term/127856/60)\n  [#](https://discourse.onlinedegree.iitm.ac.in/t/2024-t2-diploma-level-feedback-and-course-selection-for-september-2024-term/144976/62?u=s.anand)\n- Plan extra time. It takes more time than typical 3-credit courses.\n  [#](https://discourse.onlinedegree.iitm.ac.in/t/concerns-regarding-unfair-grading-practices-for-tds-project-2/160611/11)\n  [#](https://discourse.onlinedegree.iitm.ac.in/t/diploma-level-course-combo-suggestion/158460/4)\n  [#](https://discourse.onlinedegree.iitm.ac.in/t/diploma-level-course-combo-suggestion/158460/7)\n- LLMs grade you -- unpredictably.\n  [#](https://discourse.onlinedegree.iitm.ac.in/t/concerns-regarding-unfair-grading-practices-for-tds-project-2/160611/10)\n  [#](https://discourse.onlinedegree.iitm.ac.in/t/wrong-marks-in-project-2/160355/9)\n- The ROE is hard.\n  [#](https://discourse.onlinedegree.iitm.ac.in/t/is-it-fair-to-consider-20-weightage-of-such-exam-which-is-impossible-to-solve-in-given-time-i-e-roe/141413/10)\n\n**[Take Graded assignment 1](https://exam.sanand.workers.dev/tds-2025-05-ga1) to check if you're ready for this course.** Please drop this course (do it in a later term) if you score low. It'll be too tough for you now."}
{"source": "coursecontent", "title": "Note: But it's probably worth it.", "content": "Here's students' feedback:\n\n- [Course experience and farewell post](https://discourse.onlinedegree.iitm.ac.in/t/course-experience-and-farewell-post/173247)"}
{"source": "coursecontent", "title": "Note: Programming skills are a pre-requisite", "content": "You need a _good_ understanding of Python, JavaScript, HTML, HTTP, Excel, and data science concepts.\n\n**But isn't this a data science course?** Yes. Good data scientists are good programmers. Data scientists don't just analyze data or train models. They source data, clean it, transform it, visualize it, deploy it, and automate the whole process.\n\nIn some organizations, some of this work is done by others (e.g. data engineers, IT teams, etc.). But wherever you are, _some_ of the time, you need to write code for all of this yourself.\n\nThis course teaches you tools that will make you more productive. But you _do_ need programming to learn many of them."}
{"source": "coursecontent", "title": "Note: If you passed, don't enroll again", "content": "The course is public, so you can always audit it.\n\nAlso, registering again for the course [does not improve marks much](https://discourse.onlinedegree.iitm.ac.in/t/why-you-should-almost-never-register-for-tds-improvement-if-you-have-passed-it/173625)."}
{"source": "coursecontent", "title": "Evaluation - Week Unknown", "content": "Exam: P1: Project 1, Type: Online open-Internet, Weight: 20%, Release Date: Fri 16 May 2025, Submission Date: Sat 14 Jun 2025"}
{"source": "coursecontent", "title": "Evaluation - Week Unknown", "content": "Exam: ROE: Remote Online Exam, Type: Online open-Internet MCQ, Weight: 20%, Release Date: Sun 20 Jul 2025 13:00, Submission Date: Sun 20 Jul 2025 13:45"}
{"source": "coursecontent", "title": "Evaluation - Week Unknown", "content": "Exam: P2: Project 2, Type: Online open-Internet, Weight: 20%, Release Date: Fri 11 Jul 2025, Submission Date: Fri 8 Aug 2025"}
{"source": "coursecontent", "title": "Evaluation - Week Unknown", "content": "Exam: F: Final end-term, Type: In-person, no internet, Weight: 25%, Release Date: Sun 31 Aug 2025, Submission Date: Sun 31 Aug 2025"}
